---
title: Синхронный
slug: Glossary/Synchronous
tags:
  - Веб
  - Веб механика
  - Глоссарий
translation_of: Glossary/Synchronous
original_slug: Глоссарий/Синхронный
---
<p><em>Синхронный</em> относится к среде связи где каждый участник получает (и если нужно обрабатывает и/или отвечает) сообщения немедленно (или настолько быстро, на сколько это возможно).</p>

<p>Примером из жизни является телефон — во время телефонного разговора вы можете отвечать собеседнику незамедлительно.</p>

<p>Множество команд так же синхронны — например когда вы вводите значения в поле при каком-либо вычислении, результат может быть мгновенно рассчитан и выведен в поле с результатом.</p>

<h2 id="Больше_информации">Больше информации</h2>

<h3 id="Техническая_документация">Техническая документация</h3>

<ul>
 <li>{{glossary("Asynchronous")}}</li>
 <li><a href="/en-US/docs/Web/API/XMLHttpRequest/Synchronous_and_Asynchronous_Requests">Синхронные и асинхронные запросы</a> с использованием <a href="https://developer.mozilla.org/en-US/docs/Web/API/XMLHttpRequest">XMLHttpRequest()</a> {{glossary("API")}}</li>
</ul>
