---
title: Кодировка символов
slug: Glossary/character_encoding
tags:
  - Composing
  - Glossary
  - Глоссарий
translation_of: Glossary/character_encoding
original_slug: Глоссарий/character_encoding
---
<p>Кодировка определяет связность между байтами и текстом.  Последовательность байтов допускает различные текстовые интерпретации.  Указывая конкретную кодировку (например, UTF-8), мы указываем, как следует интерпретировать последовательность байтов.</p>

<p>Например, в HTML мы обычно указываем  кодировку символов UTF-8, используя следующую строку:</p>

<pre class="brush: html">&lt;meta charset="utf-8"&gt;</pre>

<p>Это гарантирует, что вы можете использовать символы практически любого человеческого языка в вашем HTML-документе, и они будут отображаться надёжно.</p>

<h2 id="Узнать_больше">Узнать больше</h2>

<h3 id="Общие_сведения">Общие сведения</h3>

<ul>
 <li><a href="https://www.w3.org/International/articles/definitions-characters/">Кодировка символов на W3C</a></li>
 <li>{{Interwiki("wikipedia", "Кодировка символов")}} на Википедия</li>
</ul>
