---
title: Справка по HTML
slug: Web/HTML/Reference
tags:
  - HTML
  - Landing
  - Web
  - Веб
  - Справка
  - лендинг
translation_of: Web/HTML/Reference
original_slug: Web/HTML/Ссылки
---
<div>{{HTMLSidebar}}</div>

<p>Эта справка описывает все <strong>элементы</strong> и <strong>атрибуты</strong> <a href="/ru/docs/Web/HTML">HTML</a>, включая <strong>глобальные атрибуты</strong>, которые применяются ко всем элементам.</p>

<dl>
 <dt><a href="/ru/docs/Web/HTML/Element">Справка по HTML-элементам</a></dt>
 <dd>На этой странице перечислены все HTML-элементы.</dd>
 <dt><a href="/ru/docs/Web/HTML/Attributes">Справка по HTML-атрибутам</a></dt>
 <dd>У элементов в HTML есть атрибуты; это дополнительные величины, которые настраивают элементы или управляют их поведением различными способами, чтобы соответствовать критериям, которые хотят пользователи.</dd>
 <dt><a href="/ru/docs/Web/HTML/Общие_атрибуты">Глобальные атрибуты</a></dt>
 <dd>Глобальные атрибуты - это атрибуты общие для всех элементов HTML; они могут использоваться на всех элементах, однако могут не оказывать влияние на некоторые элементы.</dd>
 <dt><a href="/ru/docs/Web/HTML/Типы_ссылок">Типы ссылок</a></dt>
 <dd>В HTML следующие типы ссылок указывают на связь между двумя документами, в котором один связывается с другим с помощью элементов {{HTMLElement("a")}}, {{HTMLElement("area")}} или {{HTMLElement("link")}}.</dd>
 <dt><a href="/ru/docs/Web/Guide/HTML/Content_categories">Категории контента</a></dt>
 <dd>Каждый элемент HTML принадлежит одной или более категории контента - эти категории группируют элементы, которые имеют общие характеристики.</dd>
 <dt><a href="/en-US/docs/Web/HTML/Date_and_time_formats">Форматы даты и времени, применяемые в HTML</a></dt>
 <dd>Некоторые элементы HTML позволяют вам указывать дату и/или время как значение или как значение атрибута. К ним относятся изменение даты и времени элемента {{HTMLElement("input")}}, а так же элементов {{HTMLElement("ins")}} и {{HTMLElement("del")}}.</dd>
</dl>
