---
title: Массив
slug: Glossary/array
tags:
  - JavaScript
  - Массив,
  - Программирование
  - Глоссарий
translation_of: Glossary/array
original_slug: Глоссарий/Массив
---
<p><strong>Массив</strong> это упорядоченный набор информации (смотрите также {{Glossary("Примитив")}} или {{Glossary("Объект")}}, зависит от языка). Массивы используются, чтобы сохранять множество значений или единичные переменные. Это относится к переменным, которые могут сохранять только одно значение.</p>

<p>Каждому элементу в массиве соответствует свой номер, называется он индексом, который позволяет получить к нему доступ. В JavaScript, массивы начинаются с индекса ноль и их можно изменять различными {{glossary("method","методами")}}.</p>

<p>Пример массива на JavaScript:</p>

<pre><code>var myArray = [1, 2, 3, 4];

var catNamesArray = ["Jacqueline", "Sophia", "Autumn"];

// Массивы в JavaScript могут содержать информацию различных типов, как представлено выше.
</code></pre>

<h2 id="Смотрите_также">Смотрите также</h2>

<h3 id="Основные_знания">Основные знания</h3>

<ul>
 <li>{{Interwiki("wikipedia", "Структура данных массива", "Массив")}} на Википедии</li>
</ul>

<h3 id="Техническая_справка">Техническая справка</h3>

<ul>
 <li>JavaScript {{jsxref("Array")}} на MDN</li>
</ul>
