---
title: Контейнер выравнивания
slug: Glossary/Alignment_Container
tags:
  - Контейнер выравнивания
  - CSS
  - Глоссарий
  - Выравнивание
---
<p><strong>Контейнер выравнивания</strong> — это прямоугольник, в котором выровнен {{glossary("Alignment subject","объект выравнивания")}}. Это определяется макетом: обычно это блок, содержащий объект выравнивания, учитывая режим письма, установленный для контейнера.</p>

<h2 id="Дополнительные_ресурсы">Дополнительные ресурсы</h2>

<ul>
 <li><a href="/en-US/docs/Web/CSS/CSS_Box_Alignment">Выравнивание блоков в CSS</a></li>
</ul>
