---
title: Комментарии
slug: Web/CSS/Comments
tags:
  - Beginner
  - CSS
  - CSS Reference
  - Комментарии
  - Новичку
  - Руководство
translation_of: Web/CSS/Comments
original_slug: Web/CSS/Тихий
---
<div>{{CSSRef}}</div>

<h2 id="Описание">Описание</h2>

<p>Комментарии используются для добавления поясняющих заметок или для того, чтобы предотвратить интеграцию части кода в браузер.</p>

<h2 id="Синтаксис">Синтаксис</h2>

<pre class="syntaxbox">/* Комментарий */</pre>

<h2 id="Примеры">Примеры</h2>

<pre class="brush:css">/* Однострочный комментарий */

/*
Комментарий
который содержит
несколько
строк
*/
</pre>

<h2 id="Замечания">Замечания</h2>

<p>Данный <code>/* */</code> синтаксис комментария используется для обоих вариантов, и однострочного и многострочного комментария. Нет других способов добавить комментарий во внешнюю таблицу стилей. Также, когда используется элемент &lt;style&gt;, вы можете использовать &lt;!-- --&gt;, чтобы спрятать CSS от старых браузеров, но это не рекомендуется. Как и в большинстве языков программирования, которые используют синтаксис комментариев /* */ , комментарии нельзя вкладывать друг в друга. Другими словами, данная часть синтаксиса */, которая следует за /* закрывает комментарий.</p>

<h2 id="Спецификации">Спецификации</h2>

<ul>
 <li><a href="http://www.w3.org/TR/CSS21/syndata.html#comments">CSS 2.1 Синтаксис и базовые типы данных #комментарии</a></li>
</ul>

<h2 id="Смотрите_также">Смотрите также</h2>

<ul>
 <li><a href="/ru/docs/Web/CSS/Reference">Руководство по CSS</a></li>
 <li>{{CSS_key_concepts}}</li>
</ul>
