---
title: First input delay
slug: Glossary/First_input_delay
translation_of: Glossary/First_input_delay
original_slug: Глоссарий/First_input_delay
---
<p><strong>Задержка первого ввода</strong> (англ. First input delay, FID) - одна из метрик производительности веб-страниц, которая описывает время, которое прошло с момента, когда пользователь впервые начал взаимодействовать с веб-страницей, т.е. нажал на ссылку, кнопку или использует элемент управления на основе JavaScript, до момента, когда веб-браузер может ответить на данное взаимодействие. Таким образом, это промежуток времени в миллисекундах между первым взаимодействием пользователя с веб-страницей и ответом браузера на это взаимодействие. Прокрутка и масштабирование не включены в этот показатель.</p>

<p>Время между моментом, когда содержимое отображается на странице, и моментом, когда все функциональные возможности становятся реагирующими на взаимодействие с человеком, часто варьируется в зависимости от размера и сложности JavaScript, который необходимо загрузить, проанализировать и выполнить в основном потоке. Оно зависит также и от возможности устройства, на котором выполняется JavaScript (подумайте о недорогих мобильных устройствах). Чем дольше задержка, тем хуже пользовательский опыт. Сокращение времени инициализации сайта и устранение <a href="/en-US/docs/Web/API/Long_Tasks_API">долгих задач</a> может помочь устранить первые задержки ввода.</p>

<h2 id="Смотрите_также">Смотрите также</h2>

<ul>
 <li><a href="/en-US/docs/Web/API/Window/requestIdleCallback">requestIdleCallback </a></li>
 <li><a href="/en-US/docs/Learn/Performance/Lazy_loading">lazy loading</a></li>
</ul>
