---
title: Разработка игр
slug: Games
tags:
  - Игры
  - Приложения
  - геймдев
translation_of: Games
---
<div>{{GamesSidebar}}</div>

<p>Игры являются одной из наиболее популярных компьютерных тем. С постоянным ростом новых технологий становится возможной разработка более мощных и красочных игр, которые можно запустить в любом современном браузере.</p>

<h2 id="Введение_в_разработку_web_игр">Введение в разработку web игр</h2>

<dl>
 <dt><a href="/en-US/docs/Games/Introduction" title="/en-US/docs/Games/Introduction">Введение в разработку игр для Web</a></dt>
 <dd>Ознакомление с технологиями, полезными для разработчиков игр, а также - как начать разработку игр, используя Web-технологии. Эта статья также рассматривает бизнес-кейс для создания web-игр.</dd>
 <dt><a href="/en-US/docs/Games/Anatomy_of_a_vIdeo_game">Анатомия видео игр</a></dt>
 <dd>Что такое видео игры на самом деле? Есть определённые вещи, которые являются общими для всех игр (даже если, на первый взгляд, так и не кажется). Данная статья попытается объяснить такие понятия, как основные циклы, в совершенно общем контексте. При этом она всё равно соответствует веб-стандартам.</dd>
 <dt><a href="/en-US/docs/Web/Apps/Developing/Games/Special_considerations">Особые обсуждения для разработчиков игр</a></dt>
 <dd>Эта статья из App Center бегло рассматривает вещи, которые необходимо учитывать при попытке создать игру, которая будет работать как открытое веб-приложение.</dd>
</dl>

<h2 id="Дополнительные_ресурсы">Дополнительные ресурсы</h2>

<dl>
 <dt><a href="http://buildnewgames.com/">Создание Новых Игр</a></dt>
 <dd>Совместный сайт с участием большого количества открытых веб-обучающих программ по разработке игр. Не очень активно в последнее время, но всё же содержит несколько хороших ресурсов.</dd>
 <dt><a href="http://creativejs.com/">Creative JS</a></dt>
 <dd>Коллекция впечатляющих JavaScript методов и экспериментов, не специфичных для игр, но тем не менее полезных. Не очень активно в последнее время, но всё же содержит несколько хороших ресурсов.</dd>
 <dt><a href="http://gameprogrammingpatterns.com/">Шаблоны программирования игр</a></dt>
 <dd>Онлайн-книга, написанная Bob Nystrom, которая рассказывает о шаблонах программирования в контексте разработки игр с целью помочь разработчикам создавать более эффективный, рациональный код.</dd>
 <dt><a href="http://blog.artillery.com/">Artillery blog</a></dt>
 <dd>В играх HTML5 компании Artillery есть несколько полезных статей в своём блоге.</dd>
 <dt><a href="https://leanpub.com/buildinggamesforfirefoxos/">Создание игр для Firefox OS</a></dt>
 <dd>Краткое руководство по созданию 2D-игр с HTML5 для распространения на Firefox и других мобильных платформах.</dd>
 <dt><a href="http://gamedevjsweekly.com/">Gamedev.js Weekly</a></dt>
 <dd>Еженедельная информационная бюллетень о разработке HTML5 игр, которая высылается каждую пятницу. Содержит последние статьи, руководства, инструменты и ресурсы.</dd>
 <dt><a href="http://www.html5gamedevs.com/">HTML5 Game Devs Forum</a></dt>
 <dd>Форумы для разработчиков, создателей фреймворков и издателей. Задавайте вопросы, получайте отзывы, помогайте другим.</dd>
 <dt><a href="http://html5gameengine.com/">HTML5 Game Engine</a></dt>
 <dd>Список наиболее популярных игровых фреймворков HTML5, их рейтинг, функции и примеры.</dd>
 <dt><a href="http://www.jsbreakouts.org/">JSBreakouts</a></dt>
 <dd>Сравните JavaScript клоны Breakout в разных средах, чтобы помочь вам выбрать правильный для вас.</dd>
 <dt><a href="http://gamedevelopment.tutsplus.com/">Tuts+ Game Development</a></dt>
 <dd>Учебные пособия и статьи о развитии игры в целом.</dd>
 <dt><a href="http://webchat.freenode.net/?channels=bbg">#BBG IRC chat</a></dt>
 <dd>Поговорите с разработчиками напрямую в режиме реального времени.</dd>
 <dt><a href="http://html5devstarter.enclavegames.com/">HTML5 Gamedev Starter</a></dt>
 <dd>Starter для новых игровых разработчиков, кураторский список ссылок на различные полезные ресурсы в Интернете.</dd>
 <dt><a href="http://js13kgames.com/">js13kGames</a></dt>
 <dd>Конкурс кодирования JavaScript для разработчиков игр HTML5 с ограничением размера файла, равным 13 килобайтам. Все представленные игры доступны в удобном для чтения виде на GitHub.</dd>
 <dt><a href="https://hacks.mozilla.org/category/games/">Mozilla Hacks blog</a></dt>
 <dd>Категория игр в блоге Mozilla Hacks, содержащем интересные статьи, посвящённые gamedev.</dd>
</dl>

<h2 id="Темы_разработки_игр">Темы разработки игр</h2>

<dl>
 <dt><a href="/en-US/docs/Games/Tools">Инструменты</a></dt>
 <dd>Это раздел об инструментах, созданных для облегчения создания эффективных игр для Web, таких как фреймворки, компиляторы (например, Emscripten), и инструменты для отладки. Объясняются основные концепции каждого, даётся прочная база для работы с ними.</dd>
 <dt><a href="/en-US/docs/Games/Techniques">Технические приёмы</a></dt>
 <dd>Этот раздел содержит множество статей об очень важных техниках создания игр, таких как физика, обнаружение столкновения, анимация, 3D, хранение данных, и многое другое.</dd>
 <dt><a href="/en-US/docs/Games/Workflows">Рабочий процесс</a></dt>
 <dd>Этот раздел включает в себя несколько тематических исследований об основных инструментах и методах, охватываемых выше, и применение их к созданию удивительных игр. Здесь каждый найдёт что-то полезное, являетесь ли вы опытным веб-разработчиком, желающим писать 2D или 3D игры, С++ разработчиком, задумавшим портировать свои игры в веб, или мобильным разработчиком, ищущим помощь в написании лучших мобильных игр.</dd>
</dl>

<h2 id="Примеры">Примеры</h2>

<dl>
 <dt><a href="/en-US/demos/detail/bananabread" title="/en-US/demos/detail/bananabread">BananaBread</a></dt>
 <dd>Многопользовательский трёхмерный шутер от первого лица, разработанный с использованием Emscripten, WebGL и WebRTC. Одна из первых демонстрационных игр для WebGL.</dd>
 <dt><a href="https://hacks.mozilla.org/2013/12/monster-madness-creating-games-on-the-web-with-emscripten/">Monster Madness</a></dt>
 <dd>Сетевой шутер на основе WebGL и asm.js, разработанный Nom Nom Games и Trendy entertainment.</dd>
 <dt><a href="http://www.auraluxgame.com/game/">Auralux</a></dt>
 <dd>Стратегия WebGL и asm.js: захватите все солнца, чтобы победить!</dd>
 <dt><a href="http://playcanv.as/p/JtL2iqIH">Swooop</a></dt>
 <dd>Полёт на самолёте в игре: контролируйте свой самолёт и собирайте драгоценности. Снова, созданный с <a href="https://playcanvas.com/">PlayCanvas</a>.</dd>
 <dt><a href="https://ga.me/games/polycraft">Polycraft</a></dt>
 <dd>Кораблекрушение. Исследуйте остров и победите монстров.</dd>
 <dt><a href="http://beta.unity3d.com/jonas/DT2/">Dead Trigger 2</a></dt>
 <dd>Классический zombie splatter action, выполненная в <a href="http://unity3d.com/">Unity3D</a>.</dd>
 <dt><a href="http://playbiolab.com/">Biolab Disaster</a></dt>
 <dd>Side-scrolling платформенный шутер . Ранняя попытка на холсте - классика.</dd>
</dl>

<div class="note">
<p><strong>Примечание</strong>: Для получения расширенного списка примеров см. нашу <a href="/en-US/docs/Games/Examples">страницу примеров</a>.</p>
</div>

<div class="note">
<p>Обратите внимание, что мы отслеживаем текущую работу над документацией по разработке игр на нашей <a href="/en-US/docs/Games/Doc_Status">Game development documentation status</a> странице. Если вы хотите внести свой вклад в документацию по разработке игр, ознакомьтесь с этой страницей, чтобы узнать, что нужно делать.</p>
</div>
