---
title: HTTPS
slug: Glossary/https
tags:
  - HTTPS
  - Безопасность
translation_of: Glossary/https
original_slug: Глоссарий/https
---
<p><strong>HTTPS</strong> (<em>HTTP Secure</em>) является зашифрованной версией {{Glossary("HTTP")}} протокола. Обычно он использует {{Glossary("SSL")}} или {{Glossary("TLS")}} для шифрования соединения между клиентом и сервером. Это безопасное соединение позволяет клиентам безопасно обмениваться конфиденциальными данными с сервером, например, для банковских операций или онлайн-покупок.</p>

<h2 id="Узнать_больше">Узнать больше</h2>

<h3 id="Общая_информация">Общая информация</h3>

<ul>
 <li>{{Interwiki("wikipedia", "HTTPS")}} на Википедии</li>
</ul>
