---
title: 'Как создать дизайн, подходящий для всех пользователей?'
slug: Learn/Common_questions/Design_for_all_types_of_users
tags:
  - Дизайн
  - Мобильность
  - Начинающий
  - доступность
translation_of: Learn/Common_questions/Design_for_all_types_of_users
---
<div>{{IncludeSubnav("/en-US/Learn")}}</div>

<div class="summary">
<p>Эта статья содержит основные советы, которые помогут вам создавать веб-сайты для любого типа пользователей.</p>
</div>

<table>
 <tbody>
  <tr>
   <th scope="row">Перед началом:</th>
   <td>Сначала вам следует прочитать <a href="/en-US/Learn/What_is_accessibility">What is accessibility?</a>, поскольку мы не рассматриваем здесь <strong>доступность </strong>подробно.</td>
  </tr>
  <tr>
   <th scope="row">Цель:</th>
   <td>Универсальный дизайн означает дизайн для всех, независимо от инвалидности или технических ограничений. В этой статье перечислены наиболее важные характеристики для универсального дизайна.</td>
  </tr>
 </tbody>
</table>

<h2 id="Краткое_описание">Краткое описание</h2>

<p>Когда вы создаёте веб-сайт, одна из главных проблем, которую нужно учитывать, - это универсальный дизайн: доступность для всех пользователей независимо от инвалидности, технических ограничений, культуры, местоположения и так далее.</p>

<h2 id="Более_глубокое_изучение">Более глубокое изучение</h2>

<h3 id="Цветовой_контраст">Цветовой контраст</h3>

<p>Чтобы сделать ваш текст читаемым, используйте цвет текста, который хорошо контрастирует с цветом фона. Сделайте его особенно лёгким для чтения текста, чтобы помочь слабовидящим людям и людям, использующим свои телефоны на улице.</p>

<p>{{Glossary("W3C")}} определяет хорошее сочетание цветов с помощью алгоритма, который вычисляет соотношение яркости между передним и задним планом. Расчёт может показаться довольно сложным, но мы можем положиться на инструменты, которые сделают эту работу за нас.</p>

<p>Давайте загрузим и установим <a href="http://www.paciellogroup.com/resources/contrastanalyser/">анализатор цветового контраста</a> Paciello Group.</p>

<div class="note">
<p><strong>Примечание</strong>: в качестве альтернативы вы можете найти ряд инструментов проверки контраста в интернете, таких как <a href="http://webaim.org/resources/contrastchecker/">проверка цветового контраста</a> WebAIM. Мы предлагаем локальную проверку, потому что она поставляется в комплекте с экранным цветоподборщиком, чтобы узнать значение цвета.</p>
</div>

<p>Например, давайте протестируем цвета на этой странице и посмотрим, как мы справляемся с анализатором цветового контраста:</p>

<p><img alt="Colour contrast on this page: excellent!" src="https://mdn.mozillademos.org/files/9671/colour-contrast.png" style="height: 575px; width: 799px;"></p>

<p>Коэффициент контрастности яркости между текстом и фоном составляет 8,30:1, что превышает минимальный стандарт (4,5: 1) и должно позволить многим слабовидящим людям читать эту страницу.</p>

<h3 id="Размер_шрифта">Размер шрифта</h3>

<p>Вы можете указать размер шрифта на веб-сайте либо в относительных, либо в абсолютных единицах.</p>

<h4 id="Абсолютные_единицы">Абсолютные единицы</h4>

<p>Абсолютные единицы измерения не рассчитываются пропорционально, а относятся к размеру, так сказать, набранному в камне, и выражаются большую часть времени в пикселях (<code>px</code>). Например, если в вашем CSS вы объявите это:</p>

<pre>body { font-size:16px; }
</pre>

<p>... вы говорите браузеру, что бы ни случилось, размер шрифта должен быть 16 пикселей. Современные браузеры обходят это правило, делая вид, что вы просите "16 пикселей, когда пользователь устанавливает коэффициент масштабирования 100%".</p>

<p>Однако, на протяжении многих лет Internet Explorer категорически отображается 16 на 16 пикселей. В этом случае масштабирование ничего не дало, даже в последнем Internet Explorer 8, который нам все ещё приходится обслуживать, потому что он все ещё существует.</p>

<h4 id="Относительные_единицы">Относительные единицы</h4>

<p>Также называемые пропорциональными единицами, относительные единицы вычисляются относительно родительского элемента. Относительные единицы измерения более дружелюбны к доступности, потому что они уважают настройки в системе пользователя.</p>

<p>Относительные единицы обычно выражаются в <code>em</code>, <code>%</code> и <code>rem</code>:</p>

<dl>
 <dt>Процентные размеры: <code>%</code></dt>
 <dd>Этот блок сообщает вашему браузеру, что размер шрифта элемента должен составлять N% от предыдущего элемента, размер шрифта которого был выражен. Если родитель не найден, то размер шрифта по умолчанию в браузере считается базовым размером для расчёта (обычно эквивалентным 16 пикселям).</dd>
 <dt>Em размеры: <code>em</code></dt>
 <dd>Эта единица вычисляется так же, как и проценты, за исключением того, что вы вычисляете в частях 1, а не в частях 100. Говорят, что "em" - это ширина заглавной буквы “М” в алфавите (грубо говоря, буква “М” вписывается в квадрат).</dd>
 <dt>Rem размеры: <code>rem</code></dt>
 <dd>Эта единица измерения пропорциональна размеру шрифта корневого элемента и выражается в виде частей, таких как em.</dd>
</dl>

<p>Предположим, что нам нужен базовый размер шрифта 16px и h1 (основной заголовок) в эквиваленте 32px, но если в пределах h1 мы найдём <code>промежуток </code>с классом <code>подзаголовков</code>, он тоже должен быть отрисован с размером шрифта по умолчанию (обычно 16px).</p>

<p>Вот HTML, который мы используем:</p>

<pre>&lt;!DOCTYPE html&gt;
&lt;html lang="en"&gt;
&lt;head&gt;
    &lt;meta charset="UTF-8"&gt;
    &lt;title&gt;Эксперимент с размером шрифта&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

    &lt;h1&gt;Это наш главный заголовок
        &lt;span class="subheading"&gt;Это подзаголовок&lt;/span&gt;
    &lt;/h1&gt;

&lt;/body&gt;
&lt;/html&gt;</pre>

<p>CSS на основе процентов будет выглядеть следующим образом:</p>

<pre>body { font-size:100%; } /* 100% от базового размера шрифта браузера, поэтому в большинстве случаев он будет отображаться как 16 пикселей*/
h1 { font-size:200%; } /* в два раза больше размера тела, таким образом, 32 пикселя */
span.subheading { font-size:50%; } /* половина размера h1, таким образом, 16 пикселей, чтобы вернуться к исходному размеру */
</pre>

<p>Та же проблема выражена и с ems:</p>

<pre>body { font-size:1em; } /* 1em = 100% от базового размера браузера, так что в большинстве случаев это будет выглядеть как 16 пикселей */
h1 { font-size:2em; } /* в 2 раза больше размера тела, так что 32 пикселя */
span.subheading { font-size:0.5em; } /* половина размера h1, таким образом, 16 пикселей, чтобы вернуться к исходному размеру */
</pre>

<p>Как вы можете видеть, математика быстро становится сложной, когда вам нужно следить за родителем, родителем родителя, родителем родителя родителя и так далее. (Большинство проектов выполняется в пиксельном программном обеспечении, поэтому математику должен выполнять человек, кодирующий CSS).</p>

<p>Теперь о <code>rem</code>. Эта единица измерения относится к размеру корневого элемента, а не к какому-либо другому родительскому элементу. CSS можно переписать таким образом:</p>

<pre>body { font-size:1em; } /* 1em = 100% от базового размера браузера, так что в большинстве случаев это будет выглядеть как 16 пикселей */
h1 { font-size:2rem; } /* в 2 раза больше размера тела, так что 32 пикселя */
span.subheading { font-size:1rem; } /* исходный размер */
</pre>

<p>Так ведь проще, правда? Это работает как в Internet Explorer 9, так и в любом другом поддерживаемом браузере, поэтому, пожалуйста, не стесняйтесь использовать этот способ.</p>

<div class="note">
<p><strong>Примечание:</strong> вы можете заметить, что Opera Mini не поддерживает размер шрифта в rem. В конечном итоге он будет устанавливать свой собственный размер шрифта, так что не утруждайте себя кормлением его единицами шрифта.</p>
</div>

<h4 id="Почему_мне_следует_использовать_пропорциональные_единицы_измерения">Почему мне следует использовать пропорциональные единицы измерения?</h4>

<p>Потому что вы не знаете, когда браузер придёт в себя и откажется увеличивать текст, размер которого выражается в пикселях. Кроме того, проверьте статистику вашего сайта: вы можете получать визиты из старых браузеров.</p>

<p>Мы бы посоветовали следующее:</p>

<ul>
 <li>Опишите шрифты в единицах rem, большинство браузеров будут очень довольны ими;</li>
 <li>Пусть старые браузеры отображают шрифты со своим собственным внутренним движком. Браузерные движки будут игнорировать любое свойство или значение в CSS, если они не могут справиться с ними, так что ваш сайт все ещё может быть непригодным для использования, если он не соответствует видению вашего дизайнера. Старые браузеры в любом случае находятся на пути к выходу из использования.</li>
</ul>

<div class="note">
<p><strong>Примечание</strong>: ваш пробег может варьироваться. Если вам нужно угодить старым браузерам, вам придётся использовать ems и сделать немного больше математики.</p>
</div>

<h3 id="Длина_строки">Длина строки</h3>

<p>Существует давняя дискуссия о длине строки в интернете, но вот история. Ещё в те времена, когда у нас были газеты, Печатники понимали, что глаза читателя будут с трудом переходить от одной строки к другой, если строки будут слишком длинными. Какое же решение? Столбцы.</p>

<p>Конечно, проблема не исчезает, когда мы переключаемся на интернет. Глаза читателя действуют как челнок, идущий от строки к строке. Чтобы сделать чтение проще для глаз людей, ограничьте ширину строки примерно 60 или 70 символами.</p>

<p>Для этого вы можете указать размер контейнера вашего текста. Давайте рассмотрим этот HTML:</p>

<pre>&lt;!DOCTYPE html&gt;
&lt;html lang="en"&gt;
&lt;head&gt;
    &lt;meta charset="UTF-8"&gt;
    &lt;title&gt;Эксперимент с размером шрифта&lt;/title&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;div class="container"&gt;
    &lt;h1&gt;Это наш главный заголовок
        &lt;span class="subheading"&gt;Это наш подзаголовок&lt;/span&gt;
    &lt;/h1&gt;

    &lt;p&gt;[длинный текст, который занимает много строк]&lt;/p&gt;
&lt;/div&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre>

<p>У нас есть <code>div</code> с классом <code>container</code>. Мы можем стилизовать <code>div</code> либо для установки его ширины (используя свойство <code>width</code>), либо для его максимальной ширины, чтобы он никогда не становился слишком большим (используя свойство <code>max-width</code>). Если вам нужен эластичный/адаптивный веб-сайт, и вы не знаете, какова ширина браузера по умолчанию, вы можете использовать свойство <code>max-width</code>, чтобы разрешить до 70 символов в строке и не более:</p>

<pre>div.container { max-width:70em; }</pre>

<h3 id="Альтернативный_контент_для_изображений_аудио_и_видео">Альтернативный контент для изображений, аудио и видео</h3>

<p>Веб-сайты часто включают в себя разные вещи, помимо обычного текста.</p>

<h4 id="Изображения">Изображения</h4>

<p>Изображения могут быть декоративными или информационными, но нет гарантий, что пользователь сможет увидеть их. Например,</p>

<ul>
 <li>Слабовидящие пользователи полагаются на средство чтения с экрана, которое может обрабатывать только текст.</li>
 <li>Ваши читатели могут использовать очень строгую интрасеть, которая блокирует изображения, исходящие из {{Glossary("CDN")}}.</li>
 <li>Ваши читатели могут отключить изображения для экономии пропускной способности, особенно на мобильных устройствах (см. ниже).</li>
</ul>

<dl>
 <dt>Декоративные изображения</dt>
 <dd>Они просто для украшения и не передают никакой полезной информации. Чаще всего их можно было бы заменить фоновым изображением. Убедитесь, что они имеют пустой атрибут <code>alt</code>: <code>&lt;img src="deco.gif" alt=""&gt;</code>, чтобы они не засоряли текст.</dd>
 <dt>Информационные изображения</dt>
 <dd>Они используются для передачи информации, отсюда и их название. Они могут, например, показать график, жест человека или любую другую информацию. Как минимум, вы должны предоставить соответствующий атрибут <code>alt</code>.</dd>
</dl>

<p>Если изображение может быть описано кратко, вы можете предоставить атрибут <code>alt </code>и ничего больше. Если изображение не может быть описано кратко, вам придётся либо предоставить тот же контент в другой форме на той же странице (например, дополнить круговую диаграмму таблицей, содержащей те же данные), либо прибегнуть к атрибуту <code>longdesc</code>. Значение этого атрибута представляет собой URL-адрес, указывающий на ресурс, явно описывающий в деталях содержимое изображения.</p>

<div class="note">
<p><strong>Примечание</strong>: использование и даже существование <code>longdesc </code>обсуждается уже довольно давно. Пожалуйста, обратитесь к <a href="http://www.w3.org/TR/html-longdesc/">расширению описания изображений</a> W3C (longdesc) для получения полного объяснения и подробных примеров.</p>
</div>

<h4 id="Аудиовидео">Аудио/видео</h4>

<p>Также вам стоит предоставлять альтернативы мультимедийному контенту.</p>

<dl>
 <dt>Субтитры / закрытие субтитров</dt>
 <dd>Вы должны включить подписи в своё видео, чтобы угодить посетителям, которые не могут слышать звук. Некоторые пользователи имеют проблемы со слухом, не имеют функционирующих динамиков или работают в шумной среде (например, в поезде).</dd>
 <dt>Расшифровка</dt>
 <dd>Субтитры работают только в том случае, если кто-то смотрит видео. Многие пользователи не имеют времени или не имеют соответствующего плагина или кодека. Кроме того, поисковые системы полагаются в основном на текст для индексации вашего контента. По всем этим причинам, пожалуйста, предоставьте текстовую расшифровку видео / аудиофайла.</dd>
</dl>

<h3 id="Сжатие_изображения">Сжатие изображения</h3>

<p>Некоторые пользователи могут выбрать отображение изображений, но все ещё имеют ограниченную пропускную способность, особенно в развивающихся странах и на мобильных устройствах. Если вы хотите создать успешный сайт, пожалуйста, сожмите ваши изображения. Существуют различные инструменты, которые помогут вам, как онлайн, так и локально:</p>

<ul>
 <li><strong>Устанавливаемое программное обеспечение.</strong> <a href="https://imageoptim.com/">ImageOptim</a> (Mac), <a href="http://optipng.sourceforge.net/">OptiPNG</a> (все платформы), <a href="http://pmt.sourceforge.net/pngcrush/">PNGcrush</a> (DOS, Unix/Linux)</li>
 <li><strong>Онлайн инструменты.</strong> Yahoo's <a href="https://imgopt.com/">smushit</a>!, <a href="http://tools.dynamicdrive.com/imageoptimizer/">Онлайн-оптимизатор изображений Dynamic</a> drive (который может автоматически преобразовываться из одного формата в другой, если он более эффективен с пропускной способностью)</li>
</ul>
