---
title: World Wide Web
slug: Glossary/World_Wide_Web
tags:
  - WWW
  - World Wide Web
  - инфраструктура
translation_of: Glossary/World_Wide_Web
original_slug: Глоссарий/World_Wide_Web
---
<p><span class="seoSummary">Всемирная сеть — сокращённо: <strong>WWW</strong>, <strong>W3</strong>, или<strong> Web; Сеть</strong>, <strong>паутина</strong> или <strong>веб </strong>— всемирная система публичных веб-страниц в сети {{Glossary("Интернет")}}.</span> Сеть не является Интернетом: Сеть лишь использует Интернет как среду передачи информации и данных.</p>

<p>Тим Бернерз-Ли предложил архитектуру, которая стала известна под названием World Wide Web. В 1990 году в ЦЕРН (в своей лаборатории физ. исследований) он создал первый веб-{{Glossary("Server","сервер")}},  {{Glossary("Browser","браузер")}} и веб-страницу на своём компьютере. В 1991 году он объявил про своё творение в группе новостей alt.hypertext, тем самым, обозначив момент, когда Web стал достоянием общества.</p>

<p>Система, которую мы называем Web состоит из нескольких компонентов:</p>

<ul>
 <li>Протокол <strong>{{Glossary("HTTP")}}</strong>  обеспечивает обмен данными между сервером и клиентом.</li>
 <li>Отсылая запрос серверу на определённый ресурс, клиент предоставляет неповторимый идентификатор, который зовётся <strong>{{Glossary("URL")}}</strong> (унифицированное расположение ресурсов) или {{Glossary("URI")}} (унифицированный идентификатор ресурса).</li>
 <li><strong>{{Glossary("HTML")}}</strong> (язык гипертекстовой разметки) - самый распространённый формат веб-документов.</li>
</ul>

<p>Связь страниц с помощью {{Glossary("Hyperlink","гиперссылок")}} является главной концепцией Web.</p>

<p>Незадолго после создания Web, Тим Бернерз-Ли основал {{Glossary("W3C")}} (World Wide Web Consortium) для стандартизации и последующего развития интернета. Этот консорциум состоит из: разработчиков браузеров, гос. учреждения, исследователи и университеты. Его цель - образование и распространение.</p>

<h2 id="Узнать_больше" style="line-height: 30px;">Узнать больше</h2>

<h3 id="Обучение">Обучение</h3>

<ul>
 <li><a href="https://developer.mozilla.org/en-US/Learn">Изучение веб-разработки</a></li>
 <li><a href="https://learning.mozilla.org/web-literacy">Web literacy map</a> (знания и умения, необходимые для веб-разработки)</li>
</ul>

<h3 id="Общие_ведомости" style="line-height: 24px;">Общие ведомости</h3>

<ul>
 <li>{{Interwiki("wikipedia", "World Wide Web")}} в Википедии</li>
 <li><a href="http://w3.org">Сайт международного сообщества W3C</a></li>
</ul>
