---
title: Referer
slug: Web/HTTP/Headers/Referer
tags:
  - HTTP
  - referer
  - Заголовок
translation_of: Web/HTTP/Headers/Referer
original_slug: Web/HTTP/Заголовки/Referer
---
<div>{{HTTPSidebar}}</div>

<p>Заголовок запроса <code><strong>Referer</strong></code> содержит URL исходной страницы, с которой был осуществлён переход на текущую страницу. Заголовок <code>Referer</code> позволяет серверу узнать откуда был осуществлён переход на запрашиваемую страницу. Сервер может анализировать эти данные, записывать их в логи или оптимизировать процесс кеширования.</p>

<p>Обратите внимание, что слово «Referer» на самом деле является неправильным написанием слова «Referrer». См. {{interwiki("wikipedia", "HTTP_referer", "HTTP referer на Wikipedia")}} .</p>

<div class="warning">
<p>Заголовок <code>Referer</code> может раскрыть информацию пользователя об истории посещённых страниц, что может привести к нарушению приватности.</p>

<p>Поэтому, никогда не ссылайтесь и не включайте на страницу контент без предварительной проверки конфиденциальности, безопасности и сопряжённых с этим рисков, в том числе на страницах, которые не содержат информации о риске, но связаны с ним.</p>

<p>К примеру, по умолчанию URL страницы сброса пароля будет попадать на хосты, размещающие контент на странице, и хосты ссылок, нажатых на этой странице. В обоих случаях сторонний хост получит <code>Referer</code> пользователя.</p>

<p>Существует риск, что содержимое, загруженное на страницу получит доступ к <code>Referer</code> из объекта document.referrer.</p>

<p>Остерегайтесь хостов первого эшелона, таких как хост изображений. Несмотря на кажущийся, минимальный риск, они получают ваш <code>Referer</code> и это может стать проблемой безопасности.</p>

<p>Некоторые браузеры, такие как Firefox, также отправляют <code>Referer</code> в представлениях, отличных от страниц HTML. К примеру, JsonView отправит <code>Referer</code> хосту, когда в JSON будет переход по URL-адресу, это может раскрыть приватные данные. Иногда передача <code>Referer</code> случается при работе с API, при некорректных параметрах запроса в API ключах.</p>
</div>

<p>Браузер не отправляет заголовок <code>Referer</code>, если:</p>

<ul>
 <li>исходный ресурс -- локальный "файл" или "data" URI,</li>
 <li>используется незащищённый HTTP-запрос, а исходная страница была получена с защищённым протоколом (HTTPS).</li>
</ul>

<table class="properties">
 <tbody>
  <tr>
   <th scope="row">Тип заголовка</th>
   <td>{{Glossary("Request header")}}</td>
  </tr>
  <tr>
   <th scope="row">{{Glossary("Forbidden header name")}}</th>
   <td>yes</td>
  </tr>
 </tbody>
</table>

<h2 id="Синтаксис">Синтаксис</h2>

<pre class="syntaxbox">Referer: &lt;url&gt;
</pre>

<h2 id="Указания">Указания</h2>

<dl>
 <dt>&lt;url&gt;</dt>
 <dd>Абсолютный или частичный адрес предыдущей веб-страницы, с которой был осуществлён переход на запрашиваемую страницу. Фрагменты URL-адреса (т.к. #якорь") и данные пользователя(т.к. "логин:пароль" в "https://username:password@example.com/foo/bar/") не включать.</dd>
</dl>

<h2 id="Пример">Пример</h2>

<pre>Referer: https://developer.mozilla.org/en-US/docs/Web/JavaScript</pre>

<h2 id="Спецификация">Спецификация</h2>

{{Specifications}}

<h2 id="Совместимость_с_браузерами">Совместимость с браузерами</h2>
<p>{{Compat}}</p>

<h2 id="Смотрите_также">Смотрите также</h2>

<ul>
 <li>{{interwiki("wikipedia", "HTTP_referer", "HTTP referer on Wikipedia")}}</li>
 <li>{{HTTPHeader("Referrer-Policy")}}</li>
</ul>
