---
title: Элемент
slug: Web/HTML/Element
tags:
  - HTML
  - Веб
  - Справка
  - элементы
translation_of: Web/HTML/Element
---
<p>{{HTMLSidebar("Elements")}}</p>

<p>На этой странице собраны все {{Glossary("Element","элементы")}} {{Glossary("HTML")}}. Они сгруппированы по функциям, чтобы помочь вам найти то, что вам нужно для реализации ваших идей. Хотя это руководство написано для относительных новичков в программировании, мы хотим, чтобы оно было полезным для всех.</p>

<h2 id="Основные_элементы">Основные элементы</h2>

<p>Основные элементы являются основой любого HTML документа<span>. Вы увидите эти элементы в исходном коде для всех веб-<span>страниц</span> после задания типа документа на первой строке на странице<span>. </span><span>DOCTYPE</span> определяет, какую версию (<span>X) HTML</span><span> эта</span> страница использует. Элементы страницы находятся между открывающим тегом &lt;<span>HTML&gt;</span> и закрывающим &lt;<span>/</span> HTML&gt;. Элемент</span>{{HTMLElement("html")}} называется корневым элементом<span>.</span>            </p>

<p>{{HTMLRefTable("HTML Root Element")}}</p>

<h2 id="Метаданные_документа" style="line-height: 30px; font-size: 2.14285714285714rem;">Метаданные документа</h2>

<p>Метаданные содержат информацию о странице<span>. Они включают в себя информацию о стилях<span>, скрипты</span> и данные<span>, чтобы помочь</span> программному обеспечению (<span>поисковые системы,</span> {{Glossary("Browser","браузеры")}} и т.д.<span>) использовать и</span> отображать страницу<span>.</span> Метаданные для стилей и скрипты могут быть определены на странице или ссылке на другой файл<span>, который имеет</span> информацию<span>.</span></span></p>

<p>{{HTMLRefTable("HTML Document Metadata")}}</p>

<h2 id="Секционирование_содержания" style="line-height: 30px; font-size: 2.14285714285714rem;">Секционирование содержания</h2>

<p>Секционирование содержания элементов позволяет разложить содержимое документа на логические части<span>. Используйте секционирование элементов для создания общих черт содержания страницы<span>, включая</span> шапку и подвал и заголовочные элементы для обозначения разделов<span>.</span></span>   </p>

<p>{{HTMLRefTable("HTML Sections")}}</p>

<h2 id="Текстовое_содержание" style="line-height: 30px; font-size: 2.14285714285714rem;">Текстовое содержание</h2>

<div id="gt-src-tools">
<div id="tts_button">Используйте текстовые элементы HTML для организации блоков или разделов содержания<span>, размещённые между тегами открытия &lt;<span>body&gt;</span> и закрытия &lt;<span>/</span><span>body&gt;</span><span>.</span> Важное значение для {{Glossary("accessibility")}} и {{Glossary("SEO")}}<span>,</span> чтобы эти элементы определили цель или структуру этого контента<span>.</span></span></div>

<div> </div>
</div>

<p>{{HTMLRefTable("HTML Grouping Content")}}</p>

<h2 id="Встроенные_текстовые_семантики" style="line-height: 30px; font-size: 2.14285714285714rem;">Встроенные текстовые семантики</h2>

<p>Используйте встроенную в HTML текстовую семантику<span>, чтобы определить смысл, структуру или стиль текста, линий или части текста.</span></p>

<p>{{HTMLRefTable("HTML Text-Level Semantics")}}</p>

<h2 id="Изображения_и_мультимедиа" style="line-height: 30px; font-size: 2.14285714285714rem;">Изображения и мультимедиа</h2>

<p>HTML позволяет использовать различные мультимедийные ресурсы<span>, такие как изображения<span>, аудио</span> и видео.</span></p>

<p>{{HTMLRefTable("multimedia")}}</p>

<h2 id="Встроенное_содержание" style="line-height: 30px; font-size: 2.14285714285714rem;">Встроенное содержание</h2>

<div id="gt-src-tools">
<div id="tts_button">Содержание мультимедийных HTML включает в себя другие материалы<span>, даже если они не всегда легко взаимодействуют.</span></div>

<div> </div>
</div>

<p>{{HTMLRefTable({"include":["HTML embedded content"], "exclude":["multimedia"]})}}</p>

<h2 id="Скриптинг" style="line-height: 30px; font-size: 2.14285714285714rem;">Скриптинг</h2>

<p>Чтобы создавать динамический контент и веб-приложения, HTML поддерживает использование скриптовых языков, наиболее известным является JavaScript. Некоторые элементы поддерживают эту возможность.</p>

<p>{{HTMLRefTable("HTML Scripting")}}</p>

<h2 id="Разграничительные_правки">Разграничительные правки</h2>

<p>Эти элементы позволяют вам отметить определённые части текста.</p>

<p>{{HTMLRefTable("HTML Edits")}}</p>

<h2 id="Содержание_таблиц" style="line-height: 30px; font-size: 2.14285714285714rem;">Содержание таблиц</h2>

<p>Эти элементы используются для создания и обработки табличных данных.</p>

<p>{{HTMLRefTable("HTML tabular data")}}</p>

<h2 id="Формы" style="line-height: 30px; font-size: 2.14285714285714rem;">Формы</h2>

<p>HTML содержит некоторое количество элементов, которые используются вместе для создания форм, которые пользователь может заполнить и отправить на сервер. Доступно множество информации по этой теме в <a href="/ru/docs/Web/Guide/HTML/Forms">руководстве по HTML формам</a>.</p>

<p>{{HTMLRefTable({"include": ["HTML forms"], "exclude":["Deprecated"]})}}</p>

<h2 id="Интерактивные_элементы" style="line-height: 30px; font-size: 2.14285714285714rem;">Интерактивные элементы</h2>

<p>HTML содержит в себе элементы, которые помогают создавать интерактивные объекты пользовательского интерфейса.</p>

<p>{{HTMLRefTable("HTML interactive elements")}}</p>

<h2 id="Веб-компоненты" style="line-height: 30px; font-size: 2.14285714285714rem;">Веб-компоненты</h2>

<p>Веб-компоненты - технология, относящаяся к HTML и делающая возможным создание и использование пользовательских элементов, как будто они в обычном HTML. Кроме того, вы можете даже создавать свои версии стандарта HTML элементов.</p>

<div class="note"><strong>Замечание:</strong> Эти элементы определены в {{Glossary("W3C","World Wide Web Consortium")}} (W3C) <a href="http://www.w3.org/TR/components-intro/">Web Components collection of specifications</a> скорее, чем в HTML спецификации. К тому же, спецификация Веб-компонентов не завершена и является темой для обсуждений.</div>

<p>{{HTMLRefTable({"include":["Web Components"],"elements":["shadow"]})}}</p>

<h2 id="Устаревшие_и_осуждаемые_элементы" style="line-height: 30px; font-size: 2.14285714285714rem;">Устаревшие и осуждаемые элементы</h2>

<div class="warning">
<p><strong>Предупреждение:</strong> Эти HTML элементы являются устаревшими, и их использование не рекомендуется. <strong>Вы не должны использовать их для новых проектов, а также должны заменить их в старых проектах как можно быстрее. </strong>Они перечислены здесь только в информационных целях.</p>
</div>

<p>{{HTMLRefTable({"include":["Deprecated","Obsolete"]})}}</p>
