---
title: Переменные (--*)
slug: Web/CSS/--*
tags:
  - CSS
  - CSS Variables
  - Property
translation_of: Web/CSS/--*
---
<p>{{CSSRef}}{{SeeCompatTable}}</p>

<p>Имена свойств с префиксом <code>--</code>, типа <code>--example-name</code>, представляют собой <em>пользовательские свойства</em>, содержащие значение, которое можно использовать по всему документу, используя ({{cssxref("var()")}}).</p>

<p>Пользовательские свойства участвуют в каскаде: каждое из них может появляться несколько раз, а значение переменной соответствует значению, определённому в пользовательском свойстве алгоритмом каскадирования.</p>
