---
title: Насколько дорого обойдётся сделать что-то с помощью Web?
slug: Learn/Common_questions/How_much_does_it_cost
tags:
  - Хостинг
  - начинающему
  - стоимость
translation_of: Learn/Common_questions/How_much_does_it_cost
---
<div class="summary">
<p>Веб-разработка обходится не так дёшево, как вам может показаться. В этой статье мы обсудим, как много вам потребуется потратить и почему.</p>
</div>

<table>
 <tbody>
  <tr>
   <th scope="row">Прежде чем приступить:</th>
   <td>Вам следует уже иметь представление о том, <a href="/en-US/Learn/What_software_do_I_need">какое программное обеспечение вам нужно</a>, различия между веб-страницей, веб-сайтом, и тд, а также о том, <a href="/en-US/Learn/Understanding_domain_names">что из себя представляет доменное имя</a>.</td>
  </tr>
  <tr>
   <th scope="row">Цель:</th>
   <td>Рассмотреть весь процесс создания веб-сайта и оценить расходы на каждом шаге.</td>
  </tr>
 </tbody>
</table>

<h2 id="Резюме">Резюме</h2>

<p>Запуск сайта может вам обойтись в сущее ничто, однако, ваши расходы могут достичь и критических значений. В этой статье мы обсудим, как дорого может что-либо стоить, и как вам получить то, за что вы заплатили (или не платили). </p>

<h2 id="Программное_обеспечение">Программное обеспечение</h2>

<h3 id="Текстовые_редакторы">Текстовые редакторы</h3>

<p>Вероятно, у вас уже есть текстовый редактор: например, блокнот на Windows, Gedit на Linux, TextEdit на Mac. Но вам будет легче писать код, если вы выберете редактор, который имеет подсветку синтаксиса и поможет вам наладить структуру кода.</p>

<p>Многие редакторы бесплатны, например, <a href="https://atom.io/">Atom</a>, <a href="http://brackets.io/">Brackets</a>, <a href="http://bluefish.openoffice.nl/">Bluefish</a>, <a href="http://www.barebones.com/products/textwrangler/">TextWrangler</a>, <a href="http://eclipse.org/">Eclipse</a>, <a href="https://netbeans.org/">Netbeans</a>, и <a href="https://code.visualstudio.com/">Visual Studio Code. </a>Некоторые, такие как <a href="http://www.sublimetext.com/">Sublime Text</a>, вы можете использовать в пробном режиме сколько угодно, но при этом, будете получать рекомендации о возможности приобретения. Некоторые, такие как <a href="https://www.jetbrains.com/phpstorm/">PhpStorm</a>, могут стоить от нескольких десятков до 200 долларов, в зависимости от выбранного плана. Наконец, есть те из них, такие как <a href="http://www.visualstudio.com/">Microsoft Visual Studio</a>, которые могут стоить сотни или даже тысячи долларов; хотя Visual Studio Community бесплатна для индивидуальных разработчиков или проектов с открытым исходным кодом. Часто, у платных редакторов есть также пробные версии.</p>

<p>Для начала, мы предлагаем вам попробовать несколько редакторов, чтобы понять, какой из них подходит лучше вам. Если вы пишите лишь простые {{Glossary("HTML")}}, {{Glossary("CSS")}}, and {{Glossary("Javascript")}}, используйте простой редактор.</p>

<p>Цена не влияет на качество или полезность текстового редактора. Вам необходимо попробовать и решить какой из них отвечает вашим потребностям. К примеру, Sublime Text дешёвый, но поставляется с множеством бесплатных плагинов которые могут здорово расширить его функциональность.</p>

<h3 id="Редакторы_изображений">Редакторы изображений</h3>

<p>Ваша система, вероятно, включает в себя простой редактор изображений или просмотрщик: Paint на Windows, Eye of Gnome на Ubuntu, Preview на Mac. Эти программы относительно ограничены, и вскоре вы захотите более развитый редактор, чтобы иметь возможность добавлять слои, накладывать эффекты и группировать объекты.</p>

<p>Редакторы могут быть бесплатными (<a href="http://www.gimp.org/">GIMP</a>, <a href="https://www.getpaint.net/">Paint.NET</a>), относительно недорогими (<a href="http://www.paintshoppro.com/">PaintShop Pro</a>, меньше чем $100), или иметь стоимость в пару сотен долларов (<a href="https://www.adobe.com/products/photoshop.html">Adobe Photoshop</a>).</p>

<p>Вы можете использовать любой из них, так как они имеют похожую функциональность, хотя некоторые из них настолько всеобъемлющие, что вы никогда не сможете использовать весь их функционал. Если в какой то момент вам необходимо обменяться проектами с другими дизайнерами, то вам следует выяснить, какие инструменты они используют. Редакторы могут экспортировать законченные проекты в стандартные форматы, но каждый редактор сохраняет текущие проекты в своём собственном, специализированном формате. Большинство изображений в интернете защищены авторским правом, так что лучше проверить лицензию файла, перед его использованием. Такие сайты, как <a href="https://pixabay.com/">Pixabay</a>, предоставляют изображения под лицензией Creative Commons Zero, так что вы можете использовать, редактировать, и даже публиковать их после изменения, ради коммерческой выгоды.</p>

<h3 id="Медиа_редакторы">Медиа редакторы</h3>

<p>Если вы хотите встроить видео или аудио в ваш веб-сайт, то вы можете встроить онлайн сервисы (например, YouTube, Vimeo, или Dailymotion), или встроить ваши собственные видео (см. ниже расходы на пропускную способность).</p>

<p>Для аудиофайлов, вы можете найти бесплатное программное обеспечение (<a href="http://audacity.sourceforge.net/?lang=en">Audacity</a>, <a href="http://www.wavosaur.com/">Wavosaur</a>), либо заплатить пару сотен долларов (<a href="http://www.sonycreativesoftware.com/soundforge">Sony Sound Forge</a>, <a href="http://www.adobe.com/products/audition.html">Adobe Audition</a>). Подобным образом, видеоредакторы могут быть бесплатными (<a href="http://www.pitivi.org/">PiTiVi</a>, <a href="http://www.openshot.org/">OpenShot</a> для Linux, <a href="https://www.apple.com/mac/imovie/">iMovie</a> для Mac), менее чем $100 (<a href="https://www.adobe.com/us/products/premiere-elements.html">Adobe Premiere Elements</a>), либо иметь стоимость в пару сотен долларов (<a href="https://www.adobe.com/products/premiere.html">Adobe Premiere Pro</a>, <a href="http://www.avid.com/US/products/family/Media-Composer">Avid Media Composer</a>, <a href="https://www.apple.com/final-cut-pro/">Final Cut Pro</a>). Программное обеспечение, поставляемое с вашей цифровой камерой может, также, удовлетворить все ваши нужды.</p>

<h3 id="Инструменты_публикации">Инструменты публикации</h3>

<p>Вам также потребуется возможность выгрузки файлов: с вашего жёсткого диска на удалённый веб-сервер. Чтобы осуществить это, вам потребуется утилита для публикации, такая как (S)<a href="/en-US/docs/Glossary/FTP">FTP client</a>, <a href="https://en.wikipedia.org/wiki/Rsync">RSync</a>, или <a href="https://help.github.com/articles/using-a-custom-domain-with-github-pages/">Git/GitHub</a>.</p>

<p>Каждая операционная система включает (S)FTP клиент, как часть своего файлового менеджера. Проводник Windows, Nautilus (распространённый файловый менеджер Linux), и Mac Finder - все имеют такую функциональность. Однако, люди часто выбирают удалённые (S)FTP клиенты, для одновременного отображения локальных и удалённых каталогов и хранения паролей сервера.</p>

<p>Если вы хотите установить (S)FTP клиент, то существует несколько, заслуживающих доверия, бесплатных вариантов: <a href="https://filezilla-project.org/">FileZilla</a>, <a href="http://winscp.net/">WinSCP</a> для Windows, <a href="https://cyberduck.io/">Cyberduck</a> для Mac/Windows, <a href="https://en.wikipedia.org/wiki/List_of_FTP_server_software">и другие</a>.</p>

<p>Из-за того, что FTP по своей природе небезопасен, вам следует использовать SFTP — безопасную, зашифрованную версию FTP, которую большинство хостинговых сайтов будут предлагать вам по умолчанию  — или другое безопасное решение, такое как Rsync, работающее через SSH.</p>

<h2 id="Браузеры">Браузеры</h2>

<p>У вас уже есть браузер либо вы можете  загрузить его бесплатно. Если необходимо, загрузите Firefox <a href="https://www.mozilla.org/en-US/firefox/all/">отсюда</a> или Google Chrome <a href="https://www.google.com/chrome/browser/">отсюда</a>.</p>

<h2 id="Веб-доступ">Веб-доступ</h2>

<h3 id="Компьютер_модем">Компьютер / модем</h3>

<p>Вам необходим компьютер. Расходы могут сильно варьироваться, в зависимости от вашего бюджета и места проживания. Чтобы опубликовать простой сайт, вам нужен компьютер, способный хотя бы запустить редактор и веб-браузер, таким образом порог вхождения довольно низок.</p>

<p>Конечно же, вам необходим более мощный компьютер, если вы хотите проектировать сложные конструкции, править фотографии или создавать аудио и видеофайлы.</p>

<p>Вам потребуется загружать контент на удалённый сервер (<em>см. ниже Хостинг</em>), а значит вам потребуется модем. Ваш {{Glossary("ISP", "провайдер")}} может предоставлять доступ в интернет вам за пару долларов в месяц, однако, это также зависит от места вашего проживания.</p>

<h3 id="Доступ_по_провайдеру">Доступ по провайдеру</h3>

<p>Убедитесь что у вас достаточная {{Glossary("Bandwidth", "скорость передачи данных")}}:</p>

<ul>
 <li>Доступ с низкой пропускной способностью может быть приемлем для простого веб-сайта: изображения, тексты, немного CSS и JavaScript. Это, вероятно, обойдётся вам в пару долларов, включая аренду модема.</li>
 <li>С другой стороны, вам потребуется соединения с высокой пропускной способностью, такие как DSL, оптоволокно, если вы хотите более сложный веб-сайт с сотнями файлов, или если вы хотите предоставить доступ к тяжёлым видео/аудио файлам напрямую с вашего веб-сервера. Это может стоить столько же, сколько при соединении с низкой пропускной способностью, а может вырасти до пары сотен долларов в месяц, за более профессиональные потребности.</li>
</ul>

<h2 id="Хостинг">Хостинг</h2>

<h3 id="Понимание_пропускной_способности">Понимание пропускной способности</h3>

<p>Хостинг-провайдеры взимают плату в зависимости от того, сколько {{Glossary("Bandwidth", "bandwidth")}} ваш веб-сайт потребил. Это зависит от того как много людей и бот-сканеров получали доступ к вашему контенту за определённый промежуток времени, и, как много серверного пространства этот контент занимает. Вот почему многие люди, обычно, размещают их видео на удалённых сервисах, таких как Youtube, Dailymotion, и Vimeo. Например, ваш провайдер может иметь план, который позволяет выдерживать до нескольких тысяч посетителей в день. Однако, будьте осторожны, так как это условие меняется от одного провайдера к другому. Возьмите за правило, что надёжный, платный персональный хостинг может стоить около 10-15 долларов в месяц.</p>

<div class="note">
<p>Заметьте, что не существует такого понятия, как "неограниченная пропускная способность". Если вы использовали огромное количество трафика, будьте готовы выплатить огромную сумму денег.</p>
</div>

<h3 id="Доменные_имена">Доменные имена</h3>

<p>Ваше доменное имя должно быть приобретено через провайдера доменных имён (регистратор). Ваш хостинг-провайдер может также быть регистратором (<a href="https://www.1and1.com/">1&amp;1</a>, <a href="https://www.gandi.net/?lang=en">Gandi</a>, например, являются в одно и тоже время регистраторами и хостинг-провайдерами). Доменное имя обычно имеет стоимость в $5-15 за год. Эта цена варьируется в зависимости от:</p>

<ul>
 <li>Местных обязательств: В некоторых странах домены верхнего уровня стоят дороже, так как разные страны устанавливают различные цены.</li>
 <li>Сервисов, ассоциированных с доменным именем: некоторые регистраторы предоставляют защиту от спама, скрывая ваш почтовый адрес и адрес электронной почты за их собственными адресами: почтовый адрес может быть под покровительством регистратора, и ваш электронный адрес может быть скрыт под псевдонимом регистратора.</li>
</ul>

<h3 id="Самодельный_хостинг_vs._хостинг_“из_коробки”">Самодельный хостинг vs. хостинг “из коробки”</h3>

<p>Когда вы хотите опубликовать веб-сайт, вы можете сделать все самостоятельно: настроить базу данных (если требуется), Систему управления наполнением, или {{Glossary("CMS")}} (такую как <a href="http://wordpress.org/">Wordpress</a>, <a href="http://dotclear.org/">Dotclear</a>, <a href="http://www.spip.net/en_rubrique25.html">spip</a>, и тд.), загружать заранее подготовленные вами шаблоны.</p>

<p>Вы можете использовать среду хостинг-провайдера, примерно за 10-15 долларов в месяц, или подписаться напрямую к удалённому хостинг-сервису с предустановленным CMSs (такие как, <a href="http://wordpress.com/">Wordpress</a>, <a href="https://www.tumblr.com/">Tumblr</a>, <a href="https://www.blogger.com/">Blogger</a>). В последнем случае, вам не придётся платить ни за что, но вы будете иметь меньше контроля над шаблонами и другими элементами.</p>

<h3 id="Бесплатный_хостинг_vs._платный">Бесплатный хостинг vs. платный</h3>

<p>Вы могли бы задать вопрос, почему мне следует платить за хостинг, когда существует так много бесплатных сервисов?</p>

<ul>
 <li>У вас есть больше свободы, когда вы платите. Ваш веб-сайт только в ваших руках, и вы можете легко перейти от одного хостинг-провайдера к другому.</li>
 <li>Бесплатные хостинги могут добавлять рекламные объявления к вашему контенту, в обход вашего контроля.</li>
</ul>

<p>Лучше обратиться к платному хостингу, чем полагаться на бесплатный, так как большинство платных сайтов гарантируют бесперебойную работу и позволяют с лёгкостью управлять файловой структурой. Большинство хостинг-провайдеров предоставят вам огромную скидку для старта.</p>

<p>Некоторые люди выбирают смешанный подход. Например, их главный блог на платном хосте, с полным доменном именем, а неожиданный менее важный контент, на бесплатном хосте.</p>

<h2 id="Профессиональные_веб-сайты_агентств_и_хостингов">Профессиональные веб-сайты агентств и хостингов</h2>

<p>Если вы хотите профессиональный веб-сайт, вы можете обратиться в агентство по веб-разработке, чтобы оно сделало его для вас.<br>
 <br>
 Здесь перечислены расходы, зависящие сразу от нескольких факторов:</p>

<ul>
 <li>Это простой веб-сайт с парой страничек текста? Или более сложный, с около тысячей страниц?</li>
 <li>Будете ли вы его обновлять регулярно? или это будет статический веб-сайт?</li>
 <li>Должен ли веб-сайт подсоединяться к IT структуре вашей компании, чтобы собирать контент (например, внутренние данные)?</li>
 <li>Хотите ли вы какую-нибудь уникальную функцию, которая сейчас в моде?</li>
 <li>Хотите ли вы, чтобы агентство решало сложные проблемы пользователей {{Glossary("UX")}}?</li>
</ul>

<p>...и для хостинга:</p>

<ul>
 <li>Хотите ли вы иметь резервный сервер, если вдруг ваш упадёт?</li>
 <li>Надёжность 95%, или вам требуется круглосуточный сервис обслуживания?</li>
 <li>Вам нужны высокопроизводительные, сверхчувствительные удалённые серверы или вам будет достаточно более медленной, машиной, предназначенной для совместного использования.</li>
</ul>

<p>В зависимости от ответа на эти вопросы, ваш сайт может обойтись вам в тысячи или даже сотни тысяч долларов.</p>

<h2 id="Следующие_шаги">Следующие шаги</h2>

<p>На данный момент у вас есть понимание того, во сколько вам может обойтись ваш сайт, так что настало время проектирования веб-сайта и <a href="/en-US/docs/Learn/Set_up_a_basic_working_environment">настройки вашего рабочего пространства.</a></p>

<ul>
 <li>Прочитайте о том, <a href="/en-US/docs/Learn/Choose,_Install_and_set_up_a_text_editor">как выбрать и установить текстовый редактор</a>.</li>
 <li>Если вы больше сфокусированы на проектировании, взгляните на <a href="/en-US/Learn/Anatomy_of_a_web_page">анатомию веб-страницы</a>.</li>
</ul>
