---
title: Полиморфизм
slug: Glossary/Polymorphism
tags:
  - CodingScripting
  - Glossary
translation_of: Glossary/Polymorphism
original_slug: Глоссарий/Polymorphism
---
<p><strong>Полиморфизм</strong> - это представление одного интерфейса для разных типов данных.</p>

<p>Например, целые числа (integers), числа с плавающей запятой (floats) и числа с плавающей запятой двойной точности (double) полностью полиморфны: независимо от их отличающихся типов, их можно складывать, вычитать, перемножать, и так далее.</p>

<p>В случае {{glossary("OOP","ООП")}}, возлагая ответственность на {{glossary("class","класс")}} за его код так же, как свои собственные данные, полиморфизм может быть достигнут в том, что у каждого класса есть своя {{glossary("function","функция")}}, которая (при вызове) выполняется корректно для любого {{glossary("object","объекта")}}.</p>

<h2 id="Изучить_больше">Изучить больше</h2>

<h3 id="Общие_знания">Общие знания</h3>

<ul>
 <li>{{Interwiki("wikipedia", "Полиморфизм (информатика)", "Полиморфизм")}} на Википедии.</li>
 <li><a href="https://en.wikipedia.org/wiki/Polymorphism_%28computer_science%29">Polymorphism</a> на Википедии (англ.)</li>
</ul>
