---
title: 'Учебник Express: сайт Local Library'
slug: Learn/Server-side/Express_Nodejs/Tutorial_local_library_website
tags:
  - Express
  - Node
  - nodejs
  - Введение
  - Для начинающих
  - Серверная часть
  - Учебник
translation_of: Learn/Server-side/Express_Nodejs/Tutorial_local_library_website
original_slug: Learn/Server-side/Express_Nodejs/Учебник_сайт_local_library
---
<div>{{LearnSidebar}}</div>

<div>{{PreviousMenuNext("Learn/Server-side/Express_Nodejs/development_environment", "Learn/Server-side/Express_Nodejs/skeleton_website", "Learn/Server-side/Express_Nodejs")}}</div>

<p class="summary">Первая статья в нашей серии практических уроков объясняет, что вы будете изучать, и предоставит обзор сайта "локальной библиотеки" ("local library"), над которым мы будем работать и развивать в последующих статьях.</p>

<table>
 <tbody>
  <tr>
   <th scope="row">Необходимые знания:</th>
   <td>Прочтите <a href="/en-US/docs/Learn/Server-side/Express_Nodejs/Introduction">Введение в Express</a>. Для следования статьям вам также надо будет <a href="/en-US/docs/Learn/Server-side/Express_Nodejs/development_environment">установить среду разработки Node</a>. </td>
  </tr>
  <tr>
   <th scope="row">Задача:</th>
   <td>Представить пример приложения, используемого в этом учебнике, и позволить читателям понять, какие темы будут рассмотрены. </td>
  </tr>
 </tbody>
</table>

<h2 id="Обзор">Обзор</h2>

<p>Добро пожаловать в учебник MDN «Local Library» Express (Node), в котором мы разрабатываем веб-сайт, который может использоваться для управления каталогом локальной библиотеки.</p>

<div style="padding-bottom: 30px;">В этой серии обучающих статей вы будете:</div>

<ul>
 <li>Использовать инструмент <em>Express Application Generator</em> для создания веб-сайта и скелета приложения.</li>
 <li>Запускать и останавливать веб сервер Node.</li>
 <li>Использовать базу данных для хранения данных вашего приложения.</li>
 <li>Создавать маршруты для запросов различной информации и шаблонов ("представлений") для рендеринга данных в виде HTML для отображения в браузере.</li>
 <li>Работать с формами.</li>
 <li>Развёртывать ваше приложение в производство.</li>
</ul>

<p>Вы уже имеете знания о некоторых из этих тем и кратко касались других. К концу серии уроков вы должны знать достаточно, чтобы разрабатывать простые приложения Express самостоятельно.</p>

<h2 id="Сайт_LocalLibrary">Сайт LocalLibrary</h2>

<p><em>LocalLibrary</em> это название сайта который мы будем создавать и развивать в ходе прохождения этого курса уроков. Как и следовало ожидать, цель сайта - предоставить онлайн-каталог для небольшой локальной библиотеки, где пользователи могут просматривать доступные книги и управлять своими учётными записями.</p>

<p>Этот пример был тщательно подобран, потому что он может масштабироваться, чтобы отображать насколько можно много или мало записей, и может использоваться для демонстрации почти любой возможности Express. Что ещё более важно, это позволяет нам обеспечить <em>управляемый</em> путь через функциональность, которая вам понадобится на любом веб-сайте:</p>

<ul>
 <li>В первых учебных статьях мы определим простую библиотеку, доступную <em>только для просмотра</em>, которую могут использовать члены библиотеки, чтобы узнать, какие книги доступны. Это позволяет нам исследовать операции, общие для почти каждого сайта: чтение и отображение содержимого из базы данных.</li>
 <li>По мере нашего развития, пример библиотеки, естественно, будет расширяться, чтобы продемонстрировать более продвинутые функции веб-сайта. Например, мы можем расширить библиотеку, чтобы разрешить создание новых книг, и использовать это, чтобы продемонстрировать, как использовать формы, а также поддерживать аутентификацию пользователей.</li>
</ul>

<p>Несмотря на то, что это очень масштабируемый пример, он называется <em><strong>Local</strong>Library,</em> потому что мы надеемся показать минимальную информацию, которая поможет быстро начать работать с Express. В результате мы будем хранить информацию о книгах, копиях книг, авторов и другой ключевой информации. Однако, мы не будем хранить информацию о других предметах, которые может предоставить библиотека, или предоставить инфраструктуру, необходимую для поддержки нескольких сайтов библиотек или других функций "большой библиотеки".</p>

<h2 id="Я_застрял_где_я_могу_посмотреть_код">Я застрял, где я могу посмотреть код?</h2>

<p>По мере того, как вы работаете над учебником, мы предоставим вам соответствующие фрагменты кода для копирования и вставки в каждой точке, а также будет другой код, который, мы надеемся, вы расширите самостоятельно (с некоторыми рекомендациями).</p>

<p>Если вы застряли, вы можете найти полностью разработанную версию веб-сайта <a href="https://github.com/mdn/express-locallibrary-tutorial">на Github</a>.</p>

<h2 id="Резюме">Резюме</h2>

<p>Теперь, когда вы знаете немного больше о сайте <em>LocalLIbrary</em> и о том, что мы будем изучать, пришло время приступить к созданию <a href="/en-US/docs/Learn/Server-side/Express_Nodejs/skeleton_website">скелета проекта</a>, который будет использован в нашем сайте.</p>

<p>{{PreviousMenuNext("Learn/Server-side/Express_Nodejs/development_environment", "Learn/Server-side/Express_Nodejs/skeleton_website", "Learn/Server-side/Express_Nodejs")}}</p>
