---
title: HTTP
slug: Glossary/HTTP
tags:
  - HTTP
  - Глоссарий
  - Начинающий
  - инфраструктура
  - протокол передачи гипертекста
translation_of: Glossary/HTTP
original_slug: Глоссарий/HTTP
---
<p>Протокол передачи гипертекста (HTTP) является базовым сетевым {{glossary("protocol","протоколом")}}, который позволяет передавать гипермедиа документы в {{glossary("World Wide Web","Web")}}, обычно между браузером и сервером, таким образом, что бы люди могли их читать. Текущая версия спецификации HTTP называется <a href="/ru/docs/%D0%A1%D0%BB%D0%BE%D0%B2%D0%B0%D1%80%D1%8C/HTTP_2">HTTP/2</a>.<br>
 <br>
 Как часть URI, «http://» называется «scheme» (схема) и обычно стоит в начале адреса, например, в «https://developer.mozilla.org», чтобы указать браузеру запросить документ с использованием протокола HTTP. HTTPS в этом случае относится к защищённой версии протокола HTTP, {{glossary("SSL")}} (также называемый TLS).<br>
 <br>
 HTTP является текстовым (все сообщения осуществляются в виде простого текста), без запоминания состояния (нет информации о предыдущих сообщениях). Это свойство делает его идеальным для чтения людьми документов (веб-сайтов) во всемирной паутине. Однако HTTP также можно использовать в качестве основы веб-сервисов REST для передачи сообщений от сервера к серверу или запросов AJAX на веб-сайтах, чтобы сделать их более динамичными.</p>

<div>
<h2 id="Изучите_больше">Изучите больше</h2>

<ul>
 <li><a href="/ru/docs/Web/HTTP">HTTP на сайте MDN</a></li>
 <li>{{interwiki("wikipedia", "Hypertext Transfer Protocol", "HTTP")}} на Википедии</li>
</ul>
</div>
