---
title: JSON
slug: Glossary/JSON
tags:
  - JSON
  - Введение
  - Глоссарий
  - Написание скриптов
translation_of: Glossary/JSON
original_slug: Глоссарий/JSON
---
<p><em>JavaScript Object Notation</em> (<strong>JSON</strong>) это формат обмена данными.  Несмотря на то, что JSON не является строгим подмножеством, он напоминает синтаксис {{Glossary("JavaScript")}}. Хотя много языков программирования поддерживают JSON, он особенно полезен для JavaScript-приложений, таких как веб-сайты и расширения для браузера.</p>

<p>JSON может представлять числа, булевы значения, строки, <code>null</code>, массивы (упорядоченные последовательности значений) и объекты (состоят из пар ключ-значение). Ключом является строка, значением может выступать любой примитив, массив или объект.  JSON изначально не предоставляет поддержки более сложных типов данных, таких как функции, регулярные выражения, даты и так далее.  Объекты дат по умолчанию сериализируются в строки, содержащие дату в ISO-формате, поэтому данные не будут утеряны. Если вам нужен JSON для представления дополнительных типов данных, преобразуйте значения в строку в том формате, в котором вы позже хотите его десериализовать.</p>

<p>Как и XML, JSON имеет возможность хранить иерархические данные (в отличие от более традиционного CSV формата). Существует много инструментов для переходов между этими форматами. Например,  <a href="https://json-csv.com">конвертер JSON в CSV</a>.</p>

<h2 id="Узнать_больше">Узнать больше</h2>

<h3 id="Общие_знания">Общие знания</h3>

<ul>
 <li>  <a href="https://ru.wikipedia.org/wiki/JSON">JSON</a> на Википедии</li>
</ul>

<h3 id="Техническая_информация">Техническая информация</h3>

<ul>
 <li><a href="/ru/docs/Web/JavaScript/Reference/Global_Objects/JSON">JSON</a> на MDN</li>
</ul>
