---
title: Архитектура данных
slug: Glossary/Information_architecture
translation_of: Glossary/Information_architecture
original_slug: Глоссарий/Information_architecture
---
<p>Архитектура данных, относящаяся к веб-дизайну и веб-разработке, является методом организации данных, контента или функциональности веб-сайта со всеми данными и сервисами, доступ и непосредственное использование которых не представляет трудностей, и таким образом даёт пользователю максимальное удобство в использовании данного веб-ресурса.</p>

<h2 id="Дополнительная_информация"><strong>Дополнительная информация</strong></h2>

<h3 id="Общие_сведения"><strong>Общие сведения</strong></h3>

<ul>
 <li>{{interwiki("wikipedia", "Информационная_архитектура", "Информационная архитектура")}} в Википедии</li>
</ul>
