---
title: 製品諮問委員会憲章および会員資格
slug: MDN/MDN_Product_Advisory_Board/Membership
tags:
  - MDN
  - Membership
  - PAB
  - Product advisory board
  - Terms and conditions
translation_of: MDN/MDN_Product_Advisory_Board/Membership
---
<div>{{MDNSidebar}}</div>

<h2 id="1._Purpose_and_Objectives">1. 目的および目標</h2>

<p>製品諮問委員会 (PAB) の主な目的は、コンテンツ戦略、コンテンツの優先順位付け、戦略的方向性、およびプラットフォーム／サイトの機能について、MDN のプロダクトマネージャーとコンテンツリーダーに助言、意見、およびフィードバックを提供することである。Mozilla は PAB からの意見やアドバイスを検討するが、 PAB からの意見や提案には拘束力がない。 PAB の主な目的は以下のとおりとする。</p>

<ul>
 <li>標準化文書のコンテンツ戦略と優先順位付けへのフィードバックを提供する</li>
 <li>製品戦略、ロードマップ、および優先順位の決定を支援する
  <ul>
   <li>OKR (Objectives and Key Results) についての提案とコメント</li>
   <li>年間および四半期ごとのコンテンツロードマップの提案とコメント</li>
  </ul>
 </li>
 <li>定義された戦略、ロードマップ、優先順位に基づいて、 MDN に貢献するための組織的および個人的なコミットメントを行う</li>
 <li>MDN が進化し続け、ユーザーのニーズや課題を満たすために、ユーザーの要求を代表して推進する</li>
 <li>新しい機会を提案し、フィードバックする</li>
 <li>協力者 (企業と個人の両方) の募集と維持に関するフィードバックの提供する</li>
 <li>経験とベストプラクティスの共有</li>
</ul>

<h2 id="2._Membership_Selection_and_Termination.">2. メンバーの選定と解任</h2>

<p>a. PAB は、Mozilla が選出する 10 名から 12 名のメンバー (MDN 製品諮問委員会規約に定義されているとおり、メンバー組織を代表する個人を含む) で構成される。</p>

<p>b. メンバーシップには、組織メンバーと個人メンバーの 2 種類がある。メンバーシップの基準を満たし、メンバー組織として認められた組織は、PAB の代表者 (「MDN 製品諮問委員会規約」に定義される「メンバー代表」) として、最大 2 名の個人を指名することができる。</p>

<p>c. 委員会メンバーになることを希望する組織や個人は、MDN Product Advisory Board Interest Form を提出しなければなりません。メンバーになるには、 Mozilla による審査と承認が必要であり、申請から 30 日以内に申請者に通知が送られる。</p>

<p>d. メンバーシップの開始日は、レビュー会議のスケジュールに基づいて決定され、新しいメンバーは、次に予定されているレビュー会議で委員会の任期を開始する。</p>

<p>e. 委員会のメンバーは、 1 年の任期を務め、 (いずれかの当事者によって終了させられない限り) 最大3年まで自動的に更新される。</p>

<p>f. メンバーは、書面により、委員会メーリングリストに電子メールで退会することができる。メンバー組織は、辞任したメンバーの後任を、次の検討会の開始前に指名することができる。</p>

<p>g. Mozilla は、メンバーが MDN 製品諮問委員会規約に違反した場合、MDN 委員会の行動規範に違反した場合、 Antitrust Policy に違反した場合、あるいはメンバーが予告なしに 2 回連続してレビュー会議に参加しなかった場合には、メンバーを解任することができる。その際には、代表連絡先にメンバーから外れた旨の通知が送られる。</p>

<h2 id="3._PAB_Membership_Qualifications.">3. PAB 会員の資格</h2>

<p>a. PAB のメンバーは、深い業界知識と専門性を持っている。また、 MDN の全体的な戦略目標およびコンテンツ計画を、ウェブ標準の進化、業界の方向性、および MDN のドキュメントを使用する開発者のニーズに合わせる能力と経験を有している。</p>

<p>b. PAB の会員資格は、 MDN および／またはウェブ標準の進歩、開発、および実装に多大な貢献をした組織および個人に限定される。</p>

<p>c. メンバー組織は、ウェブ標準およびガイドラインの作成、実装、または採用において重要な役割を果たしていなければなりません。また、 PAB メンバー組織は、 W3C のような確立されたウェブ標準化グループのメンバーであることが好ましい。メンバー組織は、最大 2 名の個人代表を理事会に推薦することができる。</p>

<p>d. PABの個人メンバーは、以下の資格のうち少なくとも 1 つを有していなければならない。</p>

<ul>
 <li>ウェブ標準の作成、実装、または採用において重要な役割を果たしている。</li>
 <li>ウェブブラウザーに実装された機能や、ブラウザーに送信されるウェブコンテンツで使用される機能の仕様策定を目的としたウェブ標準化グループに参加していること。 W3C または同様の標準化グループへの参加が望ましいが、必須ではない。また、個人会員は、標準作業部会に参加した経験や、確立されたウェブ標準作業部会に招待された専門家として参加した経験があれば、この資格を満たすことができる。</li>
 <li>ウェブに特化した Developer Relations チームのメンバーである。</li>
 <li>ウェブ標準の技術文書を作成するグループの一員として活動している、または</li>
 <li>ボランティアとして MDN のウェブ標準ドキュメントに重要かつ継続的な貢献をしている。</li>
</ul>

<h2 id="4._Member_Responsibilities_and_Commitments.">4. メンバーの責任と義務</h2>

<p>a. メンバーは、タイムリーにフィードバックや回答を提供し、最低数のレビューミーティングに出席することが求められる。全世界からの参加を歓迎する。メンバーに期待されることは以下の通り。</p>

<p>年次および四半期ごとの会議のスケジュールについて、フィードバックを提供する。</p>

<ul>
 <li>年次総会に出席する</li>
 <li>年に 2 回以上の四半期レビューに出席する</li>
 <li>提案を検討し、フィードバックを提供する</li>
 <li>PABのメーリングリストに参加する</li>
 <li>特に MDN 上のコンテンツの作成または編集において、特定の企業または個人のアジェンダを推進しないことに同意すること</li>
</ul>

<p>b. メンバーは、アナリスト、プレス、および／または業界の出版物やプレスリリースのために、個人情報や資料 (経歴など) の提供を求められることがありる。</p>

<p>c. すべてのメンバーは、 MDN Product Advisory Board Agreement に署名し、 MDN PAB Code of Conduct および Antitrust Policy に同意する必要がある。</p>

<h2 id="5._MDN_PAB_Member_Benefits.">5. MDN PAB メンバーの特典</h2>

<p>PAB メンバーには以下のようなメリットがあると予想されます。</p>

<ul>
 <li>MDN のコンテンツ戦略および優先事項に影響を与える</li>
 <li>MDN の戦略的方向性への影響を与えたり、MDN の計画や開発に関する事前知識が得られたりする</li>
 <li>MDN の視聴者や貢献度を高めるための機能やプラットフォームの改善を提案する</li>
 <li>コンテンツのフィードバックや技術的なレビューを行う</li>
</ul>

<h2 id="6._Scheduled_and_Ad_Hoc_Meetings.">6. 定期会議と臨時会議</h2>

<p>a. メンバーは以下の会議に招待される。</p>

<ul>
 <li>毎年10月から12月の間に開催される年次製品戦略検討会</li>
 <li>四半期ごとに開催されるコンテンツ戦略および優先順位決定のためのレビューミーティング (以下、「四半期レビュー」)</li>
 <li>必要に応じて Mozilla またはメンバーが開始できる、臨時の製品レビュー／チェックインミーティング (以下「臨時会議」という)</li>
</ul>

<p>b. 年 1 回の製品戦略レビュー会議では、前年度の進捗状況を確認し、次年度の MDN の戦略および目標について提言を行う。</p>

<p>c. 年次製品戦略レビュー会議は、PAB の投票により決定された、Mozilla 本社またはワールドワイドオフィス、メンバーのオフィス、または外部の場所で出席することができる。直接出席できないメンバーには、バーチャルでの出席にも対応する。</p>

<p>d. 四半期レビューおよび臨時会議は、主にビデオ/会議電話で行われるが、メンバーの判断により、直接出席することもできる。</p>

<p>e. 臨時委会議の日程は、開発中の作業に応じて決定される。例えば、製品の発売日や主要な機能に関連した調整や、広範にリリースされる新しい仕様や規格に関連して、四半期レビューを超えたより詳細な調整や計画が必要になるなど、特定の重点が置かれる。</p>

<h2 id="7._Time_Commitment_and_Costs.">7. 時間的拘束とコスト</h2>

<p>a. メンバーは、少なくとも 12 ヶ月間、PAB に参加することが求められる。</p>

<p>b. メンバーは、定期的に開催される PAB 会議や臨時会議の準備、出席 (時には主催)、参加に時間を割くことが求められる。</p>

<p>c. 参加者の旅費や生活費、その他の関与にかかる費用は、個々のメンバーまたはスポンサー組織が負担すること。</p>

<h2 id="See_also">関連情報</h2>

<ul>
 <li><a href="/ja/docs/MDN/MDN_Product_Advisory_Board">製品諮問委員会ホーム</a></li>
 <li><a href="https://github.com/mdn/pab">Product Advisory Board meeting minutes</a> (GitHub)</li>
 <li><a href="/ja/docs/MDN/MDN_Product_Advisory_Board/Members">製品諮問委員会メンバー</a></li>
 <li><a href="https://www.surveygizmo.com/s3/4024118/MDN-Advisory-Board-Application">Membership application</a></li>
</ul>
