---
title: Navigator.vibrate()
slug: Web/API/Navigator/vibrate
translation_of: Web/API/Navigator/vibrate
---
<p>{{APIRef("HTML DOM")}}</p>

<p>Метод <strong><code>Navigator.vibrate()</code></strong> пульсирует вибрационным оборудованием на устройстве, если такое аппаратное обеспечение существует. Если устройство не поддерживает вибрацию, этот метод не имеет ни какого эффекта. Если шаблон вибрации уже в процессе выполнения, когда метод вызван, предыдущий шаблон останавливается и вместо него начинается новый.</p>

<p>Если метод не в состоянии вибрировать из-за недействительных параметров, он вернёт <code>false</code>, иначе вернёт <code>true</code>. Если шаблон ведёт к слишком длинной вибрации, он усекается: максимальная длина зависит от конкретной реализации.</p>

<h2 id="Syntax">Синтаксис</h2>

<pre class="syntaxbox">var <em>successBool</em> = window.navigator.vibrate(<em><var>pattern</var></em>);
</pre>

<dl>
 <dt><em>pattern</em></dt>
 <dd>Определяет шаблон вибрации и интервал паузы. Значение указывает на число миллисекунд вибрации или паузы, при чередовании. Вы можете указать либо одно значение (вибрировать постоянно определённое количество миллисекунд) или массив значений, поочерёдно: вибрировать, пауза, затем снова вибрировать. См. <a href="/en-US/docs/WebAPI/Vibration" title="/en-US/docs/WebAPI/Vibration">Vibration API</a> для уточнения деталей.</dd>
</dl>

<p>Переданное значение 0 или пустой массив, или массив содержащий все нули отменяет любой шаблон вибрации запущенный в текущий момент.</p>

<h2 id="Примеры">Примеры</h2>

<pre class="brush: js">window.navigator.vibrate(200); // Вибрировать 200ms
window.navigator.vibrate([100,30,100,30,100,200,200,30,200,30,200,200,100,30,100,30,100]); // Вибрировать 'SOS' на азбуке Морзе.
</pre>

<h2 id="Спецификации">Спецификации</h2>

{{Specifications}}

<h2 id="Совместимость_с_браузерами">Совместимость с браузерами</h2>

<p>{{Compat}}</p>

<h2 id="Смотрите_также">Смотрите также</h2>

<ul>
 <li><a href="/en-US/docs/WebAPI/Vibration" title="/en-US/docs/WebAPI/Vibration">Vibration API</a></li>
</ul>
