---
title: Интернет-провайдер
slug: Glossary/ISP
tags:
  - ISP
  - Веб
  - Интернет-провайдер
  - Глоссарий
translation_of: Glossary/ISP
original_slug: Глоссарий/Интернет-провайдер
---
<p>ISP (Интернет-провайдер) продаёт доступ к интернету, а иногда и электронную почту, веб-хостинг и VoIP, либо путём установления соединения по телефонной линии (которая раньше была распространена), либо через широкополосное соединение, такое как кабельный модем или DSL-сервис. </p>

<h2 id="Узнайте_больше">Узнайте больше</h2>

<h3 id="Общие_знания">Общие знания</h3>

<ul>
 <li><a href="https://developer.mozilla.org/ru/docs/Learn/How_the_Internet_works">Как работает Интернет</a> (объяснение для новичков)</li>
 <li>{{interwiki("wikipedia", "Интернет-провайдер", "Интернет-провайдер")}} на Википедия</li>
</ul>
