---
title: <font>
slug: Web/HTML/Element/font
translation_of: Web/HTML/Element/font
---
<div>{{obsolete_header}}</div>

<h2 id="Summary">Summary</h2>

<p><em>HTML фонт элемент</em>(<code>&lt;font&gt;</code>) определяет размер шрифта, цвета и лицо для его содержимого</p>

<div class="note">
<p>Примечание по применению:</p>

<p><strong>Не используйте этот элемент! </strong></p>

<p>Хотя он был нормализован в HTML 3.2, он был устаревшим в HTML 4.01, в то время как все элементы, относящиеся только к стилю, затем устарели в HTML5.</p>

<p>Начиная с HTML 4, HTML больше не передаёт информацию о стиле (вне элемента {{HTMLElement ("style")}} или атрибута style для каждого элемента). Для любой новой веб-разработки стили должны быть написаны только с использованием CSS.

Предыдущее поведение элемента {{HTMLElement ("font")}} может быть достигнуто и даже лучше контролироваться с помощью CSS CSS-свойств шрифтов.</p>

</div>

<h2 id="Атрибут">Атрибут</h2>

<p>Как и все другие элементы, этот элемент поддерживается с  <a href="/en-US/docs/HTML/Global_attributes" title="HTML/Global attributes">global attributes</a>.</p>

<dl>
 <dt>{{htmlattrdef("color")}}</dt>
 <dd>
 <p>Этот атрибут устанавливает цвет текста, используя либо именованный цвет, либо цвет, указанный в шестнадцатеричном формате #RRGGBB.</p>
 </dd>
 <dt>{{htmlattrdef("face")}}</dt>
 <dd>
 <p>Этот атрибут содержит список разделённых запятыми одного или нескольких имён шрифтов. Текст документа в стиле по умолчанию отображается на первой грани шрифта, поддерживаемой браузером клиента. Если в локальной системе не указан шрифт, браузер обычно по умолчанию использует пропорциональный или фиксированный шрифт для этой системы.</p>
 </dd>
 <dt>{{htmlattrdef("size")}}</dt>
 <dd>
 <p>Этот атрибут определяет размер шрифта как числовое или относительное значение. Числовые значения варьируются от 1 до 7, при этом 1 является наименьшим, а 3 - значением по умолчанию. Его можно определить с использованием относительного значения, например, +2 или -3, которые устанавливают его относительно значения атрибута {{htmlattrxref ("size", "basefont")}} {{HTMLElement ("basefont") }}, или по отношению к 3, значение по умолчанию, если оно не существует.</p>
 </dd>
</dl>

<h2 id="DOM_interface">DOM interface</h2>

<p>Этот элемент реализует интерфейс {{domxref ("HTMLFontElement")}}</p>

<h2 id="Browser_compatibility">Browser compatibility</h2>

<p>{{Compat}}</p>

<div>{{HTMLRef}}</div>
