---
title: Инкапсуляция
slug: Glossary/Encapsulation
tags:
  - CodingScripting
  - Glossary
translation_of: Glossary/Encapsulation
original_slug: Глоссарий/Encapsulation
---
<p>Инкапсуляция - это упаковка данных и {{glossary("function","функций")}} в один компонент (например, {{glossary("class","класс")}}) и последующий контроль доступа к этому компоненту, создавая тем самым "чёрный ящик" из {{glossary("object","объекта")}}. По этой причине, пользователю необходимо знать только интерфейс этого класса (то есть данные и функции, предоставляемые для взаимодействия с классом извне), а не то, как он реализован внутри.</p>

<h2 id="Изучить_больше">Изучить больше</h2>

<h3 id="Общие_знания">Общие знания</h3>

<ul>
 <li>{{interwiki("wikipedia", "Инкапсуляция_(программирование)", "Инкапсуляция")}} на Википедии</li>
</ul>
