---
title: Пропускная способность
slug: Glossary/Bandwidth
tags:
  - Глоссарий
  - инфраструктура
translation_of: Glossary/Bandwidth
original_slug: Глоссарий/Bandwidth
---
<p><strong>Пропускная способность</strong> (скорость передачи данных) - мера количества информации, которая может быть передана по каналу связи за заданный промежуток времени. Обычно измеряется в величинах, кратных битам в секунду (бит/с), например в мегабитах (Мбит/с) или гигабитах (Гбит/с) в секунду.</p>

<h2 id="Узнать_больше">Узнать больше</h2>

<ul>
 <li>{{Interwiki("wikipedia", "Скорость_передачи_данных", "Скорость передачи данных")}} на Википедии.</li>
</ul>
