---
title: Проект MDN
slug: MDN
tags:
  - Landing
  - MDN Meta
translation_of: MDN
---
<div>{{MDNSidebar}}</div>

<p><strong>Сеть Разработчиков Mozilla</strong> (Mozilla Developer Network или MDN) — это вики, в которой мы описываем Открытый Интернет, технологии Mozilla, Firefox OS и другие темы, посвящённые веб-разработке. Любой желающий может добавить или отредактировать содержимое вики. Совсем не обязательно быть программистом или знать в совершенстве описываемые технологии; есть множество разных задач, не требующих особых знаний или умений, от простых (чтение с подтверждением о соответствии материала и исправление опечаток) до сложных (написание документации к API).</p>

<div class="summary">
<p>Цель проекта MDN — задокументировать Открытый Интернет, технологии и проекты Mozilla. Мы приглашаем вас помочь нам!</p>
</div>

<p>Нам требуется ваша помощь! Это просто. Вам не нужно просить разрешения или бояться совершить ошибку. C другой стороны, вы можете присоединиться к <a href="/ru/docs/MDN/Community">сообществу MDN</a>; мы здесь, чтобы помочь вам! Приведённая ниже информация поможет вам начать.</p>

<ul>
 <li><a href="/ru/docs/MDN/Getting_started">Быстрый старт для новичков</a>

  <p>Вы впервые столкнулись с MDN и желаете узнать, как сделать её ещё лучше? Начните отсюда!</p>
 </li>
 <li><a href="/ru/docs/MDN/Contribute">Я продвинутый пользователь</a>
  <p>Если вы уже комфортно чувствуете себя на MDN, получите доступ к нашему полному и глубокому руководству для участников сообщества.</p>
 </li>
 <li><a class="new" href="/ru/docs/MDN/Promote" rel="nofollow">Расскажите другим о Mozilla</a>
  <p>Если вам нравится MDN, помогите нам популяризовать его! Получите инструменты, руководства, арт для продвижения и развития MDN.</p>
 </li>
</ul>
