---
title: Веб-страницы, веб-сайты, веб серверы и поисковики
slug: Learn/Common_questions/Pages_sites_servers_and_search_engines
tags:
  - ActiveLearning
  - Beginner
  - WebMechanics
  - Активное изучение
  - Новичку
  - Программисту
translation_of: Learn/Common_questions/Pages_sites_servers_and_search_engines
original_slug: Learn/Pages_sites_servers_and_search_engines
---
<div class="summary">
<p>В этой статье мы расскажем о различных понятиях связанных с Веб: о веб-страницах, веб-сайтах, веб-серверах и о поисковых системах. Эти термины часто ставят в тупик как начинающих работу с Веб, так и людей, редко пользующихся сетью. Давайте же разберёмся, что именно эти понятия означают!</p>
</div>

<table>
 <tbody>
  <tr>
   <th scope="row">Необходимые знания:</th>
   <td>
    <p>Вы должны знать,  <a href="/en-US/Learn/How_the_Internet_works">как работает Интернет</a>.</p>
   </td>
  </tr>
  <tr>
   <th scope="row">Цель:</th>
   <td>Изучить различия между веб-страницами, веб-сайтами, веб-серверами и поисковыми системами.</td>
  </tr>
 </tbody>
</table>

<h2 id="В_двух_словах">В двух словах</h2>

<p>Как и любая другая область знаний, Веб полон специфичных терминов. Но не волнуйтесь, мы не хотим перегружать вас в самом начале вашего пути (а если любопытство всё же берёт верх, то у нас есть <a href="/ru/docs/MDN/Doc_status/Glossary">глоссарий</a>). Однако, для начала несколько базовых терминов всё же придётся усвоить, так как вы будете встречать их в наших статьях довольно часто. Иногда эти термины легко перепутать, так как они связаны между собой, но имеют разные функции. Вы, наверное, не раз замечали их неправильное употребление в новостях или где-либо ещё.</p>

<p>Мы разберём эти понятия и технологии чуть позже, а сейчас краткие определения ниже станут для вас очень хорошим началом:</p>

<dl>
 <dt>Веб-страница</dt>
 <dd>Документ, который может быть отображён веб-браузерами, такими как: Firefox, Google Chrome, Microsoft Internet Explorer / Edge или Safari от Apple. Само понятие "веб-страница" для краткости будем называть просто "страница".</dd>
 <dt>Веб-сайт</dt>
 <dd>Коллекция веб-страниц, связанных между собой какими-либо способами. Употребление в лексике: "веб-сайт" или просто "сайт".</dd>
 <dt>Веб-сервер</dt>
 <dd>Компьютер, предоставляющий компьютерное и программное обеспечение, необходимое для функционирования веб-сайта.</dd>
 <dt>Поисковая система</dt>
 <dd>Веб-сайт, помогающий в поиске других веб-страниц, например такие как: Google, Bing или Yahoo.</dd>
</dl>

<h2 id="Активное_изучение">Активное изучение</h2>

<p><em>Пока что активное изучение не доступно. Если вы можете предоставить полезную информацию, то, <a href="https://developer.mozilla.org/en-US/docs/MDN/Getting_started">пожалуйста, окажите нам содействие</a>. </em></p>

<h2 id="Погружаемся_глубже">Погружаемся глубже</h2>

<p>Итак, давайте копнём чуть глубже и узнаем, как эти 4 термина связаны между собой, и почему данные понятия зачастую путают друг с другом.</p>

<h3 id="Веб-страница">Веб-страница</h3>

<p><strong>Веб-страница</strong> - простой документ, отображаемый на экране компьютера посредством <a href="https://ru.wikipedia.org/wiki/%D0%91%D1%80%D0%B0%D1%83%D0%B7%D0%B5%D1%80">браузера</a>. Такой документ написан языком <a href="https://ru.wikipedia.org/wiki/HTML">HTML</a>  (который мы рассмотрим более детально <a href="https://developer.mozilla.org/en-US/docs/Web/HTML">в других статьях</a>). Веб-страница может содержать множество различных материалов, таких как:</p>

<ul>
 <li><em>стилевая информация</em> — контролирование страницы по восприятию и ощущению</li>
 <li><em>скрипты </em>— которые делают страницу более динамичной и удобной в использовании для пользователей</li>
 <li><em>медиа</em> — изображения, музыка и видео.</li>
</ul>

<div class="note">
<p><strong>Примечание: </strong>браузеры зачастую могут отображать некоторые документы в формате <a href="https://ru.wikipedia.org/wiki/Portable_Document_Format">PDF</a> файла или изображения, но термин <strong>веб-страница</strong> больше относится непосредственно к HTML-документам. До конца статьи, в данном случае, мы будем использовать понятие  <strong>документ</strong>.</p>
</div>

<p>Все веб-страницы в сети имеют свой уникальный адрес. Чтобы получить доступ к нужной странице просто наберите её адрес в адресной строке вашего браузера:</p>

<p style="text-align: center;"><img alt="Example of a web page address in the browser address bar" src="https://mdn.mozillademos.org/files/8529/web-page.jpg" style="float: left; height: 239px; width: 650px;"></p>













<p><em>Веб-сайт</em> - это коллекция страниц, связанных между собой какими-либо способами (включая их связи с иными ресурсами), которые доступны под единым доменным именем. Каждая страница сайта содержит прямые ссылки (практически всегда выделенные части текста, по которым можно кликнуть мышью), что позволяет пользователю быстро переходить от одной страницы веб-сайта к другой.</p>

<p>Чтобы получить доступ к веб-сайту, наберите его доменное имя в адресной строке браузера, и ваш браузер отобразит главную страницу сайта или, по-другому, домашнюю страницу:</p>

<p><img alt="Example of a web site domain name in the browser address bar" src="https://mdn.mozillademos.org/files/8531/web-site.jpg" style="height: 365px; width: 650px;"></p>

<p><em>Веб-страницу </em>и<em> веб-сайт </em>особенно легко спутать между собой, когда <em>сайт</em> содержит всего одну <em>страницу. </em>Такой сайт иногда называют <em>одностраничным веб-сайтом.</em></p>

<h3 id="Веб-сервер">Веб-сервер</h3>

<p><em>Веб-сервер</em> - это компьютер, предоставляющий в сеть один или множество <em>веб-сайтов (хостинг)</em>. Понятие "хостинг" - означает, что все <em>страницы </em>и прикреплённые к ним файлы содержатся на данном компьютере. Т.е. <em>Веб-сервер</em> будет отправлять любую <em>страницу</em> с <em>сайта</em> по запросу любого пользователя, что и будет хостингом для браузера пользователя.</p>

<p>Не путайте понятия <em>веб-сайта</em> и <em>веб-сервера</em>. Например, если вы слышите, что кто-либо говорит: "Мой веб-сайт не отвечает", на самом деле это означает, что это <em>веб-сервер</em> не отвечает на запрос, и поэтому недоступен и сам <em>сайт.</em> Более того, так как веб-сервер может разместить несколько сайтов, термин веб-сервер никогда не используется для обозначения веб-сайта, так как это могло бы привести к большой путанице. Вернёмся к предыдущему примеру: если бы мы сказали: "Мой веб-сервер не отвечает", это значило бы, что на этом сервере нет доступных сайтов в данный момент.</p>

<h3 id="Поисковая_система">Поисковая система</h3>

<p><em>Поисковые системы</em> являются распространённой причиной путаницы в сети. <em>Поисковая система</em> - это специальный вид веб-сайта, который помогает пользователям найти нужные страницы <em>других</em> сайтов.</p>

<p>Наиболее популярные поисковые системы: <a href="https://www.google.com/">Google</a>, <a href="https://www.bing.com/">Bing</a>, <a href="https://www.yandex.com/">Yandex</a>, <a href="https://duckduckgo.com/">DuckDuckGo</a>, и многие другие. Некоторые из них универсальны, а какие-то ориентированы на определённую область. Используйте тот поисковик, который удобен вам.</p>

<p>Многие начинающие пользователи сети путают между собой поисковую систему и браузер. Давайте поясним: <em><strong>браузер</strong></em> - это программное обеспечение, которое находит и отображает веб-страницы; <strong><em>поисковая система</em></strong> - это специальный вид сайта, который помогает пользователям найти нужные страницы <em>других</em> сайтов. Путаница возникает из-за того, что когда кто-либо впервые запускает браузер, тот отображает домашнюю страницу поисковой системы. Это именно так, ведь первое, что вы делаете, запуская браузер, это находите веб-страницу и открываете её. Но не путайте инфраструктуру (т.е. браузер) с сервисом (т.е. поисковой системой). Это отличие несколько поможет вам, но даже некоторые специалисты произвольно употребляют данные понятия, так что из-за этого не следует особо переживать. </p>

<p>Ниже пример того, как браузер Firerox по умолчанию отображает окно поиска Google на стартовой (домашней) странице:</p>

<p><img alt="Example of Firefox nightly displaying a custom Google page as default" src="https://mdn.mozillademos.org/files/8533/search-engine.jpg" style="height: 399px; width: 650px;"></p>

<h2 id="Смотрите_также">Смотрите также</h2>

<ul>
 <li>Погружаемся глубже: <a href="https://developer.mozilla.org/ru/docs/Learn/What_is_a_web_server">что такое Веб-сервер</a></li>
 <li>Рассмотрим, как веб-страницы связаны с веб-сайтом: <a href="https://developer.mozilla.org/ru/docs/Learn/Understanding_links_on_the_web">Разбираемся с веб-ссылками</a></li>
</ul>
