---
title: Java
slug: Glossary/Java
tags:
  - Java
  - Глоссарий
  - Язык программирования
translation_of: Glossary/Java
original_slug: Глоссарий/Java
---
<p>Java — {{glossary("Compile", "компилируемый")}}, {{glossary("OOP", "объектно-ориентированный")}} и легко переносимый язык {{Glossary("computer programming", "программирования")}}.</p>

<p>Java {{glossary("Static typing", "статически типизирован")}} и имеет C-подобный синтаксис. Содержит большую библиотеку полезных функций — инструменты разработчика Java (Java Software Development Kit, SDK).</p>

<p>Программы {{glossary("Compile", "компилируются")}} единоразово до запуска в проприетарный байт-код определённого формата, который выполняется в виртуальной машине Java (Java Virtual Machine, JVM). JVM существует для множества платформ, что позволяет программам на Java запускаться почти везде без необходимости перекомпиляции или пересборки. Благодаря этому Java широко используется в приложениях предприятий с гетерогенной средой, при этом часто считается тяжеловесным решением.</p>

<h2 id="Узнать_больше">Узнать больше</h2>

<h3 id="Общая_информация">Общая информация</h3>

<ul>
 <li>{{interwiki("wikipedia", "Java")}} в Википедии</li>
</ul>
